[{"by": "Zef", "descendants": 0, "id": 2160770, "score": 4, "text": "", "time": 1296463779, "title": "Mobl - language to develop mobile web apps: reactive programming, CPS transform ", "type": "story", "url": "http://www.mobl-lang.org/", "label": "story"}, {"by": "swannodette", "descendants": 0, "id": 2495247, "score": 2, "text": "", "time": 1304027647, "title": "Optimized Code via CPS and beta-reduction", "type": "story", "url": "http://www.artisancoder.com/2011/04/cps-and-beta-reduction/", "label": "story"}, {"by": "sortuniq", "descendants": 3, "id": 2575003, "kids": [2575175, 2575193], "score": 2, "text": "Hi,<p>I have a successful career in IT and not having an undergrad degree has never been an issue for me.<p>However, I'd really like to earn a degree.. it's a goal of mine.<p>I am looking for a program where I will actually learn new things.  Something tech related would be ideal, but I am open to other things if they are interesting to me.<p>I'm in the Boston area, and I'm open to both online courses as well as attending in person.  I'd actually like the ability to be able to take some courses in person, when possible.<p>I did attend Northeastern's CPS program &#60;http://cps.neu.edu&#62; but honestly I didn't find anything challenging or interesting about what they offered.  Truthfully, that is the reason why I never obtained a degree previously.  I always felt that I could learn more myself.  Yet, it is a goal that I want to achieve - but I don't want to achieve it just to do it, I want to actually get something out of it and enjoy it.<p>Any suggestions on programs to look at?  I need something that will allow me to continue working as I take courses.<p>Thanks in advance for your suggestions.", "time": 1306126204, "title": "Ask HN: successful career, but want to get an undergrad degree.. what program?", "type": "story", "url": "", "label": "ask"}, {"by": "jamn", "id": 2575175, "kids": [2578491], "parent": 2575003, "text": "You've probably seen this already, but have you considered the Harvard Extension School? I don't know the details, but I do know the extension school offers some classes taught by the same professors that teach regular Harvard classes.<p>An example of these classes is Prof. Michael Mitzenmacher's algorithm's class, which is both challenging and fun. I think the class is offered online and maybe in person during the summer. \n(<a href=\"http://www.extension.harvard.edu/2010-11/courses/21462.jsp?caller=dce\" rel=\"nofollow\">http://www.extension.harvard.edu/2010-11/courses/21462.jsp?c...</a> )", "time": 1306133062, "type": "comment", "label": "ask"}, {"by": "sortuniq", "id": 2578491, "parent": 2575175, "text": "Yeah I am aware of the Harvard Extension school.  They require an on-campus course up front but it would be a big pain for me to go to Cambridge for that.  Not to mention it is a writing course which is something I have already done elsewhere.", "time": 1306206315, "type": "comment", "label": "ask"}, {"by": "michaelpinto", "id": 2575193, "parent": 2575003, "text": "What's your true passion? That's what you should study!", "time": 1306134006, "type": "comment", "label": "ask"}, {"by": "jlongster", "descendants": 1, "id": 4008747, "kids": [4010923], "score": 6, "text": "", "time": 1337706562, "title": "Compiling to CPS Javascript (part 2): stepping debuggers, no callback hell, etc", "type": "story", "url": "http://jlongster.com/2012/05/18/cps-results.html", "label": "story"}, {"by": "mahmud", "id": 4010923, "parent": 4008747, "text": "Very interesting. Seems like you're having heckova time, cheers! :-)", "time": 1337734786, "type": "comment", "label": "story"}, {"by": "amasad", "descendants": 0, "id": 4346781, "score": 1, "text": "", "time": 1344280955, "title": "Writing Interpreters in JavaScript using CPS and Trampolining to avoid blocking", "type": "story", "url": "http://blog.amasad.me/2012/07/17/on-vms-in-javascript/", "label": "story"}, {"by": "lmacvittie", "dead": true, "descendants": -1, "id": 4408034, "score": 1, "text": "", "time": 1345476783, "title": "Architecting Scalable Infrastructures: CPS versus DPS", "type": "story", "url": "https://devcentral.f5.com/weblogs/macvittie/archive/2012/08/20/architecting-scalable-infrastructures-cps-versus-dps.aspx", "label": "story"}, {"by": "eaxitect", "descendants": 0, "id": 5200334, "score": 1, "time": 1360582660, "title": "Presidential Innovation Fellows: Cyber-Physical Systems | The White House", "type": "story", "url": "http://www.whitehouse.gov/innovationfellows/cyber-physical-systems", "label": "story"}, {"by": "brudgers", "descendants": 0, "id": 5347154, "score": 2, "text": "", "time": 1362798877, "title": "CPS Recursive Ascent Parsing", "type": "story", "url": "http://www.cs.rit.edu/~anh/RecurAscentPaper.pdf", "label": "story"}, {"by": "abustamam", "descendants": 1, "id": 8375975, "kids": [8375978], "score": 7, "text": "", "time": 1411788563, "title": "How letting my kid play outside led to a CPS investigation", "type": "story", "url": "http://www.dallasnews.com/opinion/sunday-commentary/20140925-how-letting-my-kid-play-alone-outside-led-to-a-cps-investigation.ece", "label": "story"}, {"by": "abustamam", "id": 8375978, "parent": 8375975, "text": "I&#x27;m not the author of this piece I just thought it was pretty incredulous that such a thing happened. Very few things scar a child for life than police at the door or worse, in the home.", "time": 1411788639, "type": "comment", "label": "story"}, {"by": "satyajoshi", "dead": true, "id": 9008514, "score": 1, "time": 1423221176, "title": "Cyber-physical Systems (CPS)", "type": "story", "url": "http://www.ansmachine.net/2015/02/cyber-physical-systems-cps.html", "label": "story"}, {"by": "avalaunch", "descendants": 68, "id": 9703663, "kids": [9704008, 9703847, 9703893, 9704185, 9704172, 9704043, 9703808, 9703984, 9704815, 9703966, 9704125, 9703920, 9704088, 9704199, 9707782, 9703830, 9703883, 9703870, 9704089], "score": 121, "time": 1434075743, "title": "11-Year-Old Boy Played in His Yard. CPS Took Him, Felony Charge for Parents", "type": "story", "url": "http://reason.com/blog/2015/06/11/11-year-old-boy-played-in-his-yard-cps-t", "label": "story"}, {"by": "jbigelow76", "id": 9704008, "kids": [9704056, 9704118, 9708235, 9704055, 9704070], "parent": 9703663, "text": "Maybe it&#x27;s just me but I&#x27;m having a hard time taking this story seriously. The list of affronts visited on the family (strip searches, cops pissing on property, foster worse than the parents, humiliation of the parents by the state) makes it a story sound almost too good to be true if you are looking to rile up your readership.<p>No identifying information is another big red flag, the parents of the free range kids hassled for letting their kids walk a mile to the park were all over media but this even more horrible (if true) story of kids being taken away for playing in the back yard is totally anonymous? Come on.<p>The bar to get me to hate on bureaucratic drones is pretty low, over shoot it too much and you take the fun away.", "time": 1434082316, "type": "comment", "label": "story"}, {"by": "jpatokal", "id": 9704056, "kids": [9704082, 9704068], "parent": 9704008, "text": "Per the details in the original post, she is employed by a school, and has been suspended and told to not to talk to media until this is over:<p><a href=\"http:&#x2F;&#x2F;www.freerangekids.com&#x2F;boy-11-plays-basketball-in-own-yard-as-he-awaits-delayed-parents-cops-take-him-brother-away-for-a-month&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freerangekids.com&#x2F;boy-11-plays-basketball-in-own-...</a><p>And given the steady stream of well-documented, actual and equally ridiculous cases like this on Free Range Kids, I doubt this is a prank.", "time": 1434083150, "type": "comment", "label": "story"}, {"by": "jbigelow76", "id": 9704082, "parent": 9704056, "text": "I don&#x27;t think it&#x27;s <i>impossible</i> that this story is true, nor do I think it&#x27;s a prank, but I wonder if the original author were pressed for identifying details if they would claim it was an amalgamation of different cases crafted into one &quot;cautionary tale&quot;.", "time": 1434083727, "type": "comment", "label": "story"}, {"by": "tsotha", "id": 9704068, "parent": 9704056, "text": "They want to make an example out of her.", "time": 1434083322, "type": "comment", "label": "story"}, {"by": "aaron695", "id": 9704118, "kids": [9704128], "parent": 9704008, "text": "Every time I can fact check a story from reason.com it&#x27;s almost always not telling the whole truth.<p>I like alternate media picking up on buried stories, I just wish they could do it without lying but perhaps this is why the stories are not picked up, they are more complicated than reason.com&#x27;s simple tales.", "time": 1434084605, "type": "comment", "label": "story"}, {"by": "tptacek", "id": 9704128, "parent": 9704118, "text": "I have the same experience. There are no other reports of this story (apart from Skenazy&#x27;s blog). I went looking through Florida police blotters in April for neglect charges. I read some pretty heinous shit (cages, for instance, were involved in one case). Nothing this dumb.<p>Skenazy doesn&#x27;t even need to be biased or dishonest for this story not to be the whole truth (or true at all); she just has to not fact-check it.<p>I&#x27;d be curious if anyone came up with a way to independent corroborate any part of this story.", "time": 1434084824, "type": "comment", "label": "story"}, {"by": "tptacek", "id": 9708235, "parent": 9704008, "text": "More stuff got posted today, but if anything it just muddies the water further.<p>Romanesko posted it to his Facebook feed yesterday after a journalist forwarded it to him calling it &quot;bullshit&quot;. People have been picking the story apart since then. Some telling bits:<p>* Florida doesn&#x27;t have &quot;Child Protective Services&quot;, the proper noun Skenazy repeatedly uses; Florida has a DCF.<p>* Skenazy&#x27;s story claims that the parents were unable to visit their child because the relative they left them with lived across county lines. But a felony charge doesn&#x27;t prevent you from crossing county lines.<p>* By Skenazy&#x27;s own account (I&#x27;m surprised I missed this): the kids were placed in longer-term foster care because the &quot;slightly problematic&quot; relative they left them with <i>put them back in foster care</i> without informing the parents.<p>* It&#x27;s apparently not normal process in Florida for neglect charges to create both civil and criminal cases. I think it&#x27;s also possible Skenazy, who is not an attorney, is confused: there may be civil-looking paperwork required to place the kids in temporary care.<p>* A careful reading of the original story suggests that the kid(s?) may have been locked out longer than 90 minutes; the timespans you have to account for are: the time before the neighbor noticed the kid(s?) out in the rain, the time after that where the kids remain outside unattended until the police arrive, and then the time it took for the police to <i>wait at the house with the kids</i> (which also doesn&#x27;t sound right; why didn&#x27;t they just take the kids to the station?).<p>What we actually know right now:<p>* Somebody set of parents in Florida, who may or may not live in the same place (the single page of court documentation posted lists them separately) had some sort of run-in with juvenile court involve one or more kids.<p>* A lawyer reviewed paperwork not yet released and said that it corroborates the parents story.<p>Of course, the parents could be reporting accurately the actions of the police on that day, but leaving out a bunch of additional context from prior to that day.", "time": 1434139896, "type": "comment", "label": "story"}, {"by": "ghaff", "id": 9704055, "parent": 9704008, "text": "Yeah, I don&#x27;t much care for the apparent general trend and there have certainly been some documented cases that are pretty ridiculous. I daresay things that I did as a child at various ages would shock a lot of people today.<p>That said, this particular story is from:\nLenore Skenazy is host of the reality show “World’s Worst Mom”  on the Discovery Life Channel, starting Jan. 22. She is also a public speaker and founder of the book and blog Free-Range Kids.<p>That doesn&#x27;t make it wrong. But it clearly comes from someone who is on a particular side of the issue. And a quick search doesn&#x27;t uncover original reportage from elsewhere. So color me skeptical.", "time": 1434083143, "type": "comment", "label": "story"}, {"by": "cactusface", "id": 9704070, "kids": [9704127, 9704081], "parent": 9704008, "text": "Maybe the parents simply contacted the author with the story and asked not to be named.  It&#x27;s kind of pointless journalism though if you have no verifiable facts.  In some other stories she uses real and full names; she has a TV show and is a published author; I don&#x27;t feel like she made this up.", "time": 1434083390, "type": "comment", "label": "story"}, {"by": "nsxwolf", "id": 9704127, "parent": 9704070, "text": "She has a pretty good reputation, and has had no shortage of stories like this to report on, so I doubt she want or need to would tarnish all that.<p>It might just be that in a country with 300 million people, this is going to happen once in a while. It may or may not represent a general erosion of parent&#x27;s rights and civil liberties.", "time": 1434084818, "type": "comment", "label": "story"}, {"by": "Klinky", "id": 9704081, "kids": [9704106], "parent": 9704070, "text": "Having a reality TV show and running a popular blog would make me think they&#x27;re more likely to spin or embellish things.", "time": 1434083648, "type": "comment", "label": "story"}, {"by": "ghaff", "id": 9704106, "parent": 9704081, "text": "Or simply not probe too deeply into a really perfect story about how horrible things have gotten. Might not be the case here but, if it were, hardly unique. See, for example, this discussion of the Rolling Stone Duke story: <a href=\"http:&#x2F;&#x2F;www.bloombergview.com&#x2F;articles&#x2F;2015-05-21&#x2F;a-messy-answer-beats-too-good-to-be-true-\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloombergview.com&#x2F;articles&#x2F;2015-05-21&#x2F;a-messy-ans...</a>", "time": 1434084178, "type": "comment", "label": "story"}, {"by": "PebblesHD", "id": 9703847, "kids": [9704054, 9704041, 9703872, 9704107, 9709006, 9704045, 9707046], "parent": 9703663, "text": "I say this literally every time a story like this pops up but, as ever, I&#x27;ll say it again: Have the (adults) in charge completely lost their minds? Is the government so out of touch with reality that this makes sense to them? I loved going on walks or riding my bike to the shops or sleeping in&#x2F;playing at home when i was 10 or 11, and yet now this seems all but impossible to consider? How the hell did this happen?", "time": 1434079424, "type": "comment", "label": "story"}, {"by": "rbcgerard", "id": 9704054, "kids": [9704350, 9704171], "parent": 9703847, "text": "Agreed, in the summers (in small town america), when i was that age i was kicked out of the house after breakfast and not allowed back (unless it was raining) until lunch, and then kicked out again until dinner. I loved running around outside with my friends, our dogs, horrendously constructed forts, and our bb guns. The &quot;bad&quot; parents were the ones that let their kids stay home and vegetate in front of the TV. What happened?", "time": 1434083130, "type": "comment", "label": "story"}, {"by": "icebraining", "id": 9704350, "parent": 9704054, "text": "<i>The &quot;bad&quot; parents were the ones that let their kids stay home and vegetate in front of the TV.</i><p>I believe that&#x27;s still considered true, the &quot;good parents&quot; will instead arrange for the kids to have lots of supervised activities and organized play dates. It&#x27;s all about making sure the kids have no space to make their own mistakes.", "time": 1434090676, "type": "comment", "label": "story"}, {"by": "visarga", "id": 9704171, "parent": 9704054, "text": "They don&#x27;t look at TV any more, instead, they play apps. That&#x27;s what happened. Now it&#x27;s all good &#x2F;s", "time": 1434085689, "type": "comment", "label": "story"}, {"by": "vacri", "id": 9704041, "parent": 9703847, "text": "Are we being fed a heavily edited version of the story? Was there more to the parental history than is mentioned? Why hide the identity of the parents, given that they&#x27;ve already been through the wringer and the whole affair is a matter of public record?<p>Given how overloaded CPS usually are, this article fails the sniff test.", "time": 1434082937, "type": "comment", "label": "story"}, {"by": "dudul", "id": 9703872, "parent": 9703847, "text": "So true.  When people are surprised when 1 boy out of 5 is diagnosed with ADHD. They can&#x27;t do anything! They&#x27;re freaking bored!<p>Millenials are called weak, entitled and useless, but wait for the next cohort of &quot;bright&quot; minds who are gonna lead this country.  Will they be able to even feed themselves?  Is it even safe to teach a kid how to cook an egg?", "time": 1434080082, "type": "comment", "label": "story"}, {"by": "mistermann", "id": 9704107, "parent": 9703847, "text": "I read absurd stories like this and try to understand how <i>so many individual people who are involved</i> drop the ball.  All it would (should) take is one person involved to have the nerve(as if it should take nerve) to speak up and say &quot;this is ridiculous&quot;.<p>In this case (assuming this story is true, but there&#x27;s no shortage of similar stories if this one isn&#x27;t), it took a <i>fucking child</i> to have the nerve to state the obvious:<p>*\nBut then, according to Cindy, &quot;My son spoke up.&quot; He said he wanted to talk to the judge. Surprised, their lawyer asked the boy: Did he have the courage to go through with this? And would he tell the truth? The boy said yes. &quot;He went back there and spoke to the judge for about ten minutes,&quot; said Cindy. &quot;And then the judge came out and called the two lawyers to the bench and talked to them for about 10 or 15 minutes. And with that, our lawyer came to us and said that if we admitted that we didn&#x27;t know that it was wrong to [let our son] stay in the backyard, but that we know now that it&#x27;s wrong and we will never let it happen again, and that we will explain this to our son, he would let the children come with us.&quot;<p>Cindy and Fred promised. The judge released the kids and closed the case.\n*<p>I wonder, how does this happen, and why does it happen mostly in western countries?<p>My best theory is, unless you are a true revolutionary&#x2F;disruptor, if you are just well-above-average skill, but not Elon Musk level, your easiest ride is just playing the system.  This case (ignoring that it shouldn&#x27;t have even happened in the first place) could have been closed immediately, if people in the justice system were interested in administering <i>justice</i>.  But they&#x27;re not - they are interested in <i>revenue</i>.  Stretching cases like this out for weeks &#x2F; months increases (or at least maintains) federal funding requirements, but it also pulls external money into the system (defense fees) that goes to your brothers and sisters you attended law school with. Think of the $ this one case generated, and it&#x27;s just a kid hanging out in his back yard!<p>It&#x27;s not just the legal system that is like this, although it&#x27;s one of the worst offenders.  I see similar behavior working in IT (in medium to large companies)- things that are obviously easy to fix, problems that aren&#x27;t difficult to solve (or don&#x27;t even need solving at all) turn into multi-hundred-thousand, or even multi-million $ projects.  And if you say &quot;wait a minute, does this make sense what we&#x27;re doing&quot;, your head will shortly be cut off, because so many people have skin in the game.  But if you just keep your mouth shut and go with the flow, you can make an entire career out of it.", "time": 1434084224, "type": "comment", "label": "story"}, {"by": "graycat", "id": 9709006, "parent": 9703847, "text": "Let&#x27;s look at this slightly\ndifferently:  Suppose the 10\nyear old child the CPS abducted from\nplaying safely in their back yard\nwas -- right, you guessed it --\na girl.<p>In this case some fathers might --\nI won&#x27;t if only because I&#x27;m not a\nfather -- might, ..., might,\nright, what&#x27;s the term?<p>CPS abducted his 10 year old\ndaughter:  Zuilly makes a bundle\nselling pretty princess and angel\nclothes to grand parents for their\ngrand daughters, often just 10.\nThose princess, angel clothes\nindicate some of the protective\nemotions grand parents and parents\nhave for daughters, e.g., <i>Perfect\nDaughter</i>.  In our society, there\nare strong norms that girls are\ncared for, protected.<p>And CPS abducts her?  Perfect daughter?<p>Am I getting to make this situation\nclear?<p>Okay, maybe it&#x27;s her dear dad\nor her dear uncle, one or both\nfresh back from Akrapistan,\nmaybe Army Rangers, maybe\nSeal Team 6.  And CPS abducted\nPerfect Daughter playing safely\nin her backyard?<p>CPS might be in line for a Darwin\naward.<p>Looks like Perfect Daughter\nneeds two or three very devoted,\nyoung, healthy German Shepards or\nRotweilers.<p>CPS overreach is not all just \nclick bait:  I know a family,\nwell known coast to coast, in\nUS finance, famous name,\nwealthy, generous philanthropists.\nWell, at one point a son of about\n8 in the family fell and, maybe,\nbruised his arm or some such.<p>Well, somehow CPS paid a visit.  Insisted\non getting involved.  Issued\nthis and that order\nto the parents.<p>Absurd.  Wacko.  Overreach.<p>If my startup works, I\nget financially comfortable,\nand CPS or some such\nmakes trouble for\nthe nephews, nieces, etc.\nin my family, then\nI will go to a big, powerful,\nall-go, never-stop,\nnail&#x27;em to the wall law\nfirm and see just how much\nlegal trouble we can cause\nCPS and its wackos.<p>If they want a legal fight\nand my checkbook is much \nthicker than theirs, then\nbring it on.  It will be\na good purpose for my startup\nwork.<p>I don&#x27;t like <i>gumment</i>\nwackos hurting\nfamilies and children.<p>It&#x27;s happened.  It shouldn&#x27;t.", "time": 1434148753, "type": "comment", "label": "story"}, {"by": "graycat", "id": 9704045, "kids": [9704126, 9704463], "parent": 9703847, "text": "&gt; How the hell did this happen?<p>Standard:  Some bad parents actually do\nexist.  So, with a few such examples, \nsome people who want to get attention\nget some laws passed and set up CPS\nwith some really big powers, e.g., ones\nthat violate little things like due process.\nSome of the laws mention felonies.<p>Then the CPS department gets created,\nfunded, and staffed.  Then a phone call\ncomes in, and CPS <i>swings into action</i>.<p>Then, CPS wants to look busy, <i>do their\njob</i>, believes that they are now responsible\nfor the child, wants to make sure nothing\ngoes wrong where they could be blamed, so\ntake full control of the life of the child,\nas their rules say, and to heck with\nanything like due process, the actual\ngood of the child, the good of the\nfamily, etc.  Instead, CPS becomes just\nlaw and rules driven.<p>So, CPS is brain-dead, dysfunctional,\ndangerous, destructive, demented,\nderanged, etc.  Why?  They are just\nfollowing the law and their rules\nto avoid any blame.<p>So, CPS put a torpedo just below the\nwaterline of that totally innocent\nfamily.  They did psychological\ndamage to the child; they harmed\nthe sense of security of the family;\nthey wasted the time of the family;\nthe may have wrecked the family\nfinances due to the legal costs.<p>Earlier tonight I watched the <i>Nova</i>\nprogram on the June 6, 1944 Normandy\nlanding.  I was reminded of all the\ndeath and destruction fighting Hitler.<p>But then with something like CPS\nand US police shooting unarmed Blacks\nin the back, etc., we are creating\ndisasters out of nothing, nothing\nat all, disasters, out of nothing,\nfor no good reason.<p>The judge?  He should have\nfound a way to charge the CPS\nthugs, laughed their case out of\ncourt, and put the family back \ntogether.  Since he didn&#x27;t, he\nshould get a new career\ncleaning sidewalks with a tooth brush --\n&quot;Nice and clean, now, y&#x27;hear?&quot;.<p>CPS must report to a mayor or\ngovernor, etc.  Well, with\nenough such stories, the mayor\nor whomever should ensure that the\nhead\nof CPS and everyone involved\nin that case should join\nthe judge in brushing the\nsidewalks.<p>Part of the solution is <i>sunlight</i>,\ne.g., on the Internet.<p>Too often our government has become\njust a dangerous enemy of the citizens.\nThe citizens should vote \nfor the needed changes.  Due to CPS,\nevery family with children is\nat risk of essentially just\nthugs from CPS wrecking their\nfamilies, a greater risk than a\nbomb from a terrorist and\ncomparably dangerous.<p>TSA?  Sure, they can steal money\nand valuables from your luggage and\nmolest your wife and daughters.<p>Gee, when I was 10 or so, I got\na three speed bicycle, and then,\nespecially during the summers,\nI was <i>gone</i> for hours at a time,\nsometimes 20 miles round trip.\nNo problems.<p>I was big for\nmy age:  If some CPS types\nhad tried to do something\nto me, it would have been\na fight, a real fight --\nI would have defended myself\nfrom the CPS attackers.\nSure, if I could have found\na club, I would have\nbeat them to a bloody pulp --\njust ordinary self-defense.<p>Government wants to grow, like\npoison ivy or worse.  Have to\ncut it back.  The key way:\nJust cut their budgets.  How to\ndo that?  Sure, vote.  Then\nget rid of the government\nthugs who attack citizens and\nget lower taxes.<p>Read.  Complain.  Vote.\nSolve the problem.  That&#x27;s\nwhat our democracy is for\nand some of why we really\nneed democracy.  Else the\ngovernment will grow and\ngrow and become a hostile\n<i>occupying force</i> in our\ncountry like Hitler \noccupied Poland.<p>In Normandy is a cemetery \nwith, as I recall from the\n<i>Nova</i> program, 9000 graves\nof US soldiers who fought\nfor our freedom.  Well, we\nshould not let out of control\ngovernment do to us what\nHitler would have done.", "time": 1434082979, "type": "comment", "label": "story"}, {"by": "ghshephard", "id": 9704126, "parent": 9704045, "text": "The part you didn&#x27;t mention is where CPS, and individual CPS employees are sued, and lambasted in the press when they <i>don&#x27;t</i> act, and then something happens downstream, and they end up taking all the blame.<p>I tend to agree with your general theme though, that what we&#x27;re seeing is the result of system systems that have been funded, and now are doing what they were created to do.", "time": 1434084797, "type": "comment", "label": "story"}, {"by": "kbart", "id": 9704463, "kids": [9706175], "parent": 9704045, "text": "No offence, but your comment would be more convincing without Hitler&#x2F;Nazi references.<p><a href=\"http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Godwin%27s_law\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Godwin%27s_law</a>", "time": 1434093556, "type": "comment", "label": "story"}, {"by": "graycat", "id": 9706175, "parent": 9704463, "text": "Some of the bad things government\nin the US does are as bad as some\nof what the Nazis did.  E.g.,\ngrabbing a 10 year old child playing\nharmlessly in their own back yard,\ntaking that child from its family\nfor 30 days, charging the parents\nwith a felony where they could go\nto jail, wrecking the family\nfinances from the legal costs,\nTSA stealing from luggage and\nmolesting women and girls,\nsuddenly in the middle of the\nnight\nbreaking down the door of a house\nand shooting the family dog,\nshooting an unarmed citizen in the\nback fifty feet away running\naway -- such things are quite comparable\nwith a lot, not all, of the stuff the\nNazi thugs did.<p>In simple terms,\nwhat is in common is just <i>thug</i>\nbehavior, some people (they feel\nsafer in a group of several)\nwith power and getting their\njollies and feeling more\npowerful and, thus, more secure,\nfrom exercising that power over\nothers.<p>Many of our fathers, grand fathers,\ngreat grand fathers, etc. fought\nfor our freedom.  Let&#x27;s don&#x27;t\nlet power hungry thugs, \npaid by taxes or otherwise,\ntake our freedom.<p>E.g., some years ago I was\na researcher working in artificial\nintelligence at the IBM\nWatson lab in Yorktown Heights,\nNY.  That&#x27;s in the middle of\nWestchester County, the first\ncounty north of NYC.  I lived\ntwo counties farther north, in\nDutchess county.<p>I liked to work late so often\nstayed at the office after dinner\nand drove home at about 10 PM.\nSo, if look at a map, sure, I\ndrove north on the NY Taconic\nState Parkway.  I was driving\na Buick Regal Turbo T-Type,\nright, a <i>banker&#x27;s hot rod</i>\nof the time, in very good condition.<p>For someone who has driven\nover 500,000 miles, I have\nrelatively few convictions of\nmoving traffic violations.  E.g,\nmy auto insurance bill here in NYS is\nabout $260 twice a year.  Part\nof the reason is that \nI watch for cops.<p>One night driving home in\nmy rear view mirror I noticed\nsome headlights looking like\nthey were from a car\ngaining rapidly on me.\nDriving late at night like\nthat, I tend to drive in the\nleft lane because I can\navoid cars entering or leaving\nthe road I am on from\nside roads or the shoulder.\nSo, when that car was about\n50 yards behind me, I moved to\nthe right lane to\nlet them pass.  Fine with\nme if they want to go way too fast --\ngo ahead, pass me, and be gone.<p>Well, that car shifted to the right\nlane also.  So, I had changed lanes\nand slowed down basically trying to force\nthem to pass me.<p>Well, it was a cop car with\ntwo cops.<p>I&#x27;d done nothing wrong.\nInstead, the cops had just\nseen a nice car driving\nat night on a nearly empty\nroad and decided to\nstop the car for no good reason.\nLikely that&#x27;s illegal.<p>So, they stopped me.<p>There were two cops,\none really nasty and\nangry.  He was a\nthug, out to harass a\ncitizen just for his own\njollies.  He looked young,\nlike he was a rookie on the\nforce.<p>So, he had his jollies:  He\nhad me standing on one leg,\nwalking a line, touching my nose,\netc.  The other cop stood aside\nand was not happy about the\nobvious harassment.<p>The thug cop wrote out a ticket\ncharging me with something,\nmaybe changing a lane without\nusing a turn signal, e.g.,\nwhen I was trying to shake\ntheir car off my tail.<p>While they were writing out\nthe ticket, I was sitting\nin my car reading a published\npaper in applied math.\nThe thug asked me what I\nwas reading, and I said\nhe likely wouldn&#x27;t like it.\nHe got angry and\nasked in a loud, threatening\nvoice,<p>&quot;Are you calling me\nstupid?&quot;.<p>I answered, &quot;No, but the\npaper is quite technical\nand advanced and assumes\ngraduate work in pure\nmathematics.&quot;<p>He kept harassing me, looking\nfor me to say something\nhe would use to start\na fight.<p>Finally I just drove away\nwith him standing there.\nThey didn&#x27;t pursue.<p>For the ticket, I went to\ncourt.  The cops didn&#x27;t\nshow, and the judge dismissed\nthe case.  I handed the judge\na letter describing the interaction.<p>That cop was a thug.\nHe was loose on the streets,\ncarrying a gun,\nmaking illegal traffic\nstops, harassing citizens,\ntrying to start fights,\nbasically a violent criminal,\npaid by taxes.\nHe was using his \npower to get his jollies.<p>Lesson:  Such things happen.\nThey happened with the\nNazi Brown Shirts.  They\nhappen with some US police.\nApparently they happen with\nthe TSA, DEA, DHS, FBI, \nand CPS.  We should not\ngive up our freedoms easily.\nIn our democracy,\nwe need to vote against such\nstuff.", "time": 1434120260, "type": "comment", "label": "story"}, {"by": "graycat", "id": 9707046, "parent": 9703847, "text": "Many US citizens need be more\nafraid of illegal and&#x2F;or improper\nactions by the government we pay to\nprotect them than of the bad things\ngovernment is supposed\nto be protecting them from.<p>That is, for government as a protector,\ntoo often <i>the cure is worse than\nthe disease</i>.", "time": 1434127749, "type": "comment", "label": "story"}, {"by": "femto", "id": 9703893, "parent": 9703663, "text": "&gt; The parents decided to have them placed with a slightly problematic in-state relative instead.<p>Leaving out any issues of rights, that&#x27;s the biggest issue here: that children get moved from a safe situation into a more dangerous one, in the name of keeping them safe.<p>Take this recent case in Australia [1].  A father cared enough about his child to voluntarily put him in the state&#x27;s care, whilst he sorted himself out.  The child never came home, as the state placed the child in an unsafe home, and he drowned.<p>[1] <a href=\"http:&#x2F;&#x2F;www.smh.com.au&#x2F;nsw&#x2F;parents-demand-answers-after-toddler-drowned-in-foster-carers-pool-20150522-gh77bt.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.smh.com.au&#x2F;nsw&#x2F;parents-demand-answers-after-toddl...</a>", "time": 1434080478, "type": "comment", "label": "story"}, {"by": "DenisM", "id": 9704185, "parent": 9703663, "text": "The article is likely a fake, a grown up version of the children camp horror story, and it gets retold for the same reason. In a quality news article you have to have answers to three questions: who, where, when. These three are necessary to verify claims independently, and their absence is highly suspect. There are exceptions to the rule - sometimes a journalist has to protect the people involved, such as in the case of a vulnerable crime victim or a political whistleblower (Watergate, Snowden), but then we&#x27;re basically relying on the reputation on the journalist or the newspaper in question - a track record of getting scandalous stories right.<p>In this case there is no reason to hide the names, dates, or location (as the neighbors already know and the court records are open), and there is no way to ascertain the credibility of the news source.<p>Absence of both a credible source and a credible reporter to vouch for the anonymous source breaks the chain of credibility - the article might as well be made up, and it usually is.<p>Another suspicious factor is that the claims are so outlandish - the more outrageous the claim, the more likely its a fake. When a reader is frightened or outraged he is more likely to disregard caution and share the story, and so it goes viral. For that reason outlandish stories are more likely to get shared regardless of merit, as opposed to less exceptional stories that get shared more inline with their truthfulness, and so statistically speaking an outlandish story is more likely to be a fake scare, whereas a mundane story is more likely to be true.<p>Yet another factor to consider is absence of an attempt to get the other side of the story - no mention of trying to contact CPS, or District Attorney to get their comments on the case.", "time": 1434085938, "type": "comment", "label": "story"}, {"by": "xahrepap", "id": 9704172, "kids": [9704363, 9704425], "parent": 9703663, "text": "Foster parent here (from another state than in the article).<p>I&#x27;m going to go a bit off topic, but I want to comment on this snippet:<p>&gt; [The kids had been eating] [o]nly cereal, for the past few days. That&#x27;s not going to kill anyone, obviously. But if you&#x27;re arresting parents for not supervising their kids for 90 minutes, it&#x27;s more than a little hypocritical.<p>There&#x27;s probably a good reason for that: the foster parents couldn&#x27;t get the kids to eat anything else! Perhaps they were really nervous and uncomfortable? When I&#x27;m nervous, it&#x27;s hard to eat other foods like vegetables and meats. Sometimes cereal is all I can stomach. I could only imagine how those poor, confused kids felt.<p>We were trained to feed the kids what they would eat. That means if they want a hot dog every night, you give them a freaking hot dog every night. Sometimes keeping the kid within whatever is left of their comfort zone is more important than good nutrition. As time goes on, you start mixing things up and start giving them better food. But out the gate, the most important thing is to help the kids feel comfortable.<p>People like the author of this article seem to love to paint foster parents in a bad light. They have this weird mentality I don&#x27;t understand. They don&#x27;t care about the facts, they&#x27;re just looking for anything to make everyone from the state to look like incompetent scum. Look even at this quote:<p>&gt; The kids are attending &quot;play&quot; therapy.<p>Maybe it&#x27;s because the whole article is horribly negative and lacking any kind of reference (even all the names are made up to &quot;protect the innocent&quot; or whatever), but I feel like that is sarcasm. And the sarcasm in that sentence demonstrates how much the author doesn&#x27;t know. &quot;Play&quot; therapy is a real thing, and it really helps the kids. It&#x27;s not some crazy witchcraft the state thought up. The kids might&#x27;ve been &quot;normal&quot; before this all happened, but it&#x27;s important to get kids in this situation (even the ones that weren&#x27;t abused&#x2F;neglected&#x2F;etc, like the children in the article) to make sure they&#x27;re getting the help that they need to cope with the CURRENT situation. We always try to get our foster kids in play therapy, even if they act completely &quot;normal&quot; and understanding of everything. The thing I don&#x27;t want is to think the kid is okay and then find out they&#x27;ve been holding it all back.", "time": 1434085692, "type": "comment", "label": "story"}, {"by": "neilcrj", "id": 9704363, "parent": 9704172, "text": "&gt; The thing I don&#x27;t want is to think the kid is okay and then find out they&#x27;ve been holding it all back.<p>Great insight. Kids at that age are looking for parental&#x2F;adult approval and they know that the adults around them want them to be &quot;okay.&quot; They can hide a lot of emotions if they think they&#x27;ll be loved more for being &quot;normal.&quot;", "time": 1434091040, "type": "comment", "label": "story"}, {"by": "EGreg", "id": 9704425, "kids": [9706302], "parent": 9704172, "text": "The CURRENT situation makes the kids worse off in the name of making them better? I&#x27;d rather take having my parents late without keys for 90 minutes than being taken away from my family by force and have to grow up who knows where at age 10. And these kids from broken families then do worse in life. No offense to foster parents, there is a great need to take kids in after REAL disasters where THEY want to leVe - ones where the parents are actually unfit or dead. When does leaving a kid to play in a yard the equivalent of being an angry drunk who beats your kid?", "time": 1434092621, "type": "comment", "label": "story"}, {"by": "xahrepap", "id": 9706302, "kids": [9708363], "parent": 9704425, "text": "I struggle to find in my comment where I say that&#x27;s okay.<p>&gt; No offense to foster parents, there is a great need to take kids in after REAL disasters<p>None taken, but you seem to think foster parents are somehow involved in the removal process. Here&#x27;s how it really works:<p>-Phone rings\n-Hello Mr. Foster, I have 3 siblings that I need to place. [Description of what they know]. Do you think this would be a good fit for your family?\n-Yes\n-Thank you. Can you pick them up at [location]?<p>I have no chance to say, &quot;sorry, I believe you shouldn&#x27;t have removed them. Please send them home.&quot; I mean, I can say that. But it wouldnt do any good. only the judge can make that call (in my state). I will, however, have an opportunity to expressy opinion based on how I feel after talking with the kid(s) over a period of time.<p>Obviously what is described in this article is a horrible situation. All I&#x27;m saying is that the way they describe the foster parent feeding the kids only cereal is most likely not hypocritical or even a problem. It&#x27;s more likely them focusing on getting the kid to eat <i>anything</i>.", "time": 1434121381, "type": "comment", "label": "story"}, {"by": "EGreg", "id": 9708363, "kids": [9708567], "parent": 9706302, "text": "Oh, I see. If that&#x27;s all you were saying then I wasn&#x27;t responding to that. And I didn&#x27;t mean to imply that the foster parents are responsible for the kids being taken away. Although it is good to know the foster parents can really have a voice in the process after talking with the kid, who may insist that they want to be back home.<p>I&#x27;m just saying the SYSTEM seems broken if one phonecall from a stranger can turn average parents into felons and kids into effectively orphans.", "time": 1434141416, "type": "comment", "label": "story"}, {"by": "xahrepap", "id": 9708567, "parent": 9708363, "text": "At least where I live, as the case progresses and the foster parents create a bond with the kids, they really take what the foster parents say in heavy consideration. Especially if the kids have been assigned a good Guardian Ad Litem (the child&#x27;s own lawyer).<p>The system can be broken. This is something that&#x27;s governed very differently between states. And some states are far more broken than others. I think Utah (where I live) has a very good system (one of the few government programs I&#x27;ve learned a lot about and haven&#x27;t been frustrated with how my tax dollars are spent). The numbers I&#x27;m familiar with say that 66% of all cases end with the kids going home with the parents. However, another statistic that makes that number much more impressive is that 75% of all cases, meth is involved in the home. So the state really works hard with the biological parents and places a heavy emphasis on reunification (as long as the kids will be safe from illegal activities) and the bio parents get a lot of government supported rehab no matter what the case is (ranging from parenting classes to alcohol&#x2F;drug rehab). If you do the math, that means a lot of parents are successfully getting the rehab they need to they can support their children. I think that&#x27;s impressive.", "time": 1434143453, "type": "comment", "label": "story"}, {"by": "IvyMike", "id": 9704043, "kids": [9706579], "parent": 9703663, "text": "Is there any corroboration of the story, or a response by CPS and&#x2F;or the court?  It&#x27;s very possible I missed it, but neither the article nor the comments give a solid source other than the parents.<p>Because the skeptic in me says that while CPS might be pretty bad, it&#x27;s also not inconceivable that the aggrieved parents might leave out key details of the story.  So I&#x27;d like to hear what CPS (or really, any other source) has to say before I get too up-in-arms here.", "time": 1434082955, "type": "comment", "label": "story"}, {"by": "reagency", "id": 9706579, "parent": 9704043, "text": "It&#x27;s not fair when one side (the state) intentionally gag-orders everyone, to use their silence as proof that nothing happened.", "time": 1434123895, "type": "comment", "label": "story"}, {"by": "dylanjermiah", "id": 9703808, "parent": 9703663, "text": "Your kids were without their parents for 90 minutes, so we&#x27;re going to take them for 30 days.", "time": 1434078648, "type": "comment", "label": "story"}, {"by": "VieElm", "id": 9703984, "kids": [9704087], "parent": 9703663, "text": "Here&#x27;s a similar case where a writer left her son in her car for a few minutes in a parking lot at a store:<p><a href=\"http:&#x2F;&#x2F;www.salon.com&#x2F;2014&#x2F;06&#x2F;03&#x2F;the_day_i_left_my_son_in_the_car&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.salon.com&#x2F;2014&#x2F;06&#x2F;03&#x2F;the_day_i_left_my_son_in_the...</a>", "time": 1434081959, "type": "comment", "label": "story"}, {"by": "mapt", "id": 9704087, "parent": 9703984, "text": "&quot;At the time of the incident, he never mentioned what had happened, and I assumed that he was unaware, that the best thing would be not to bring it up. But, of course, kids are astute observers and somewhere along the line, he figured it out.<p>I got out of the car one day to feed the parking meter next to the driver side window. “Don’t, Mommy. Don’t. The police will come.” I went to let the dog into our front yard while he was watching his morning cartoon. “Mommy, no!!! The police.”<p>One afternoon after his swim lesson, he came out of the bathroom and for a second didn’t see me — I’d kneeled down to get his shoes from their cubby. When I looked up he was crying. “Mommy, mommy, I thought someone was going to steal me.”<p>That evening I sat him down and tried to explain it. I told him that he was right, that mommy had left him in the car for a few minutes one time and that was a mistake. I wasn’t supposed to do that. But it was all going to be fine now. Mommy wasn’t going to jail. And no one was going to kidnap him!<p>“Most people,” I told him, “are not trying to hurt you. Most people are good people. Do you understand? You don’t have to be afraid?”<p>He nodded slowly, but I could see from his face that he only half believed me.&quot;", "time": 1434083807, "type": "comment", "label": "story"}, {"by": "zeeed", "id": 9704815, "parent": 9703663, "text": "I think that no matter how close to the truth this particular story is, there are similar ones circulating on the web and the circumstance has also made it to John Oliver&#x27;s show - which I believe does a lot with regard to credibility.<p>We need to contrast this to stories like this <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9677863\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9677863</a> [How my father gave me a terrifying lesson at 10] which received overwhelmingly positive feedback on here.<p>We are living in a society that has been induced with fear so much that parents give away the freedom even of their kids. I wonder what kind of people these kids will grow to become. And I wonder how many parents ask themselves this question.", "time": 1434101232, "type": "comment", "label": "story"}, {"by": "welly", "id": 9703966, "kids": [9704072, 9704050, 9704029], "parent": 9703663, "text": "I hate to be that person but this isn&#x27;t the actions of a country that prides itself as being free. Sadly, it&#x27;s not an isolated case either. I&#x27;ve read numerous similar accounts of such things occurring. Along with the &quot;lemonade stand permit&quot;, it&#x27;s bewildering.<p>I realise that in the grand scheme, these are fairly unique but you simply don&#x27;t hear about such things happening in Europe, in Australia or in the middle and far East. Perhaps it&#x27;s a case of similar cases happening in other nations but just not reported on so much.<p>Why do we keep reading stories like this and the deluge of police brutality and other wacky stories coming out of the USA?", "time": 1434081723, "type": "comment", "label": "story"}, {"by": "jfoutz", "id": 9704072, "kids": [9704100], "parent": 9703966, "text": "There are many things. First, Florida is odd. Dave Barry made his career out of odd things happening in Miami.<p>Perhaps more accurately, the us has a large population. It&#x27;s roughly the same size as all of western europe. With 350 million independent agents running around, you&#x27;ll get some funky edge cases.<p>And C, I think everyone is susceptible to abuse of power. There are a million stories of HOA (home owner associations) making crazy complicated rules because of smart yet bored homebodies with nothing better to do.<p>The U.S. has certain freedoms, like self defense, that you don&#x27;t see in the U.K. Freedom of speech is pretty cool, but you get these weird effects where things advertised as &quot;news&quot; aren&#x27;t actually required to tell the truth. So it&#x27;s not all sunshine and lollypops.<p>Classic puritanism tried to take comfort knowing that people not acting in a godly way would just go to hell when they died. The U.S. has a long tradition of everyone knowing everyone else&#x27;s business. And being judgmental of it. Sometimes echoes of that ring down through the ages and we get weird laws. We get the moral imperatives, but can&#x27;t really rely on bad parents going to hell, so we get kind of crazy.", "time": 1434083444, "type": "comment", "label": "story"}, {"by": "welly", "id": 9704100, "parent": 9704072, "text": "You make some good points, I&#x27;m definitely not hating on the US because I&#x27;ve lived there on for a number of years on a couple of occasions and I love the place. I&#x27;d love to actually settle there one day.<p>I suppose with a nation as big as the US and the media presence there, it would probably be much more difficult to hide such stories as it would in various European nations.", "time": 1434084023, "type": "comment", "label": "story"}, {"by": "vacri", "id": 9704050, "kids": [9704069, 9704102], "parent": 9703966, "text": "<i>in Australia</i><p>So, in Victoria at least, it was recently made illegal to leave your kids in the car for any length of time. Going inside to pay at the petrol station? Take your kids with you.<p>Admittedly it&#x27;s not going to end you up in the middle of the story in the article, and you&#x27;re going to have to be pretty unlucky to find a cop who&#x27;s enough of a dickhead to apply this law apropos of no other issues, but technically it&#x27;s now illegal to do so.", "time": 1434083079, "type": "comment", "label": "story"}, {"by": "ryan-allen", "id": 9704069, "kids": [9704112], "parent": 9704050, "text": "Really? Holy crap! I live in Victoria (don&#x27;t have kids), and this is news to me. I remember that it&#x27;s illegal to leave your kids in cars on hot days, but that&#x27;s it.", "time": 1434083376, "type": "comment", "label": "story"}, {"by": "vacri", "id": 9704112, "parent": 9704069, "text": "State legislation rarely makes the news, unless it&#x27;s about a new highway somewhere :)<p>Last Week Tonight did an episode on how state legislatures in the US are passing heaps of legislation &quot;on the sly&quot; (scare quotes because it&#x27;s not really sly, just no-one watches them...), and it&#x27;s similar over here. Hell, I keep forgetting our current premier&#x27;s name, and I voted for him... and I couldn&#x27;t tell you the name of a single other state politician who isn&#x27;t a party leader. I&#x27;ve even forgotten the name of the guy involved in the union scandal last week...", "time": 1434084437, "type": "comment", "label": "story"}, {"by": "welly", "id": 9704102, "kids": [9704138], "parent": 9704050, "text": "Crazy. I&#x27;m up in the Northern Territory and it feels like anything goes here. (Almost).", "time": 1434084068, "type": "comment", "label": "story"}, {"by": "vacri", "id": 9704138, "parent": 9704102, "text": "NT doesn&#x27;t have a proper state parliament, so you miss out on a lot of the fun. Fewer services, but fewer restrictions.", "time": 1434084982, "type": "comment", "label": "story"}, {"by": "ddingus", "id": 9704029, "parent": 9703966, "text": "Authoritarians.  They are the ones escalating all this petty garbage, IMHO.", "time": 1434082717, "type": "comment", "label": "story"}, {"by": "isaacg", "id": 9704125, "kids": [9704140], "parent": 9703663, "text": "I looked up the relevant part of the legal code:<p>3)(a) &quot;Neglect of a child&quot; means:<p>1. A caregiver&#x27;s failure or omission to provide a child with the care, supervision, and services necessary to maintain the child&#x27;s physical and mental health, including, but not limited to, food, nutrition, clothing, shelter, supervision, medicine, and medical services that a prudent person would consider essential for the well-being of the child; or<p>2. A caregiver&#x27;s failure to make a reasonable effort to protect a child from abuse, neglect, or exploitation by another person.<p>Neglect of a child may be based on repeated conduct or on a single incident or omission that results in, or could reasonably be expected to result in, serious physical or mental injury, or a substantial risk of death, to a child.<p>If I&#x27;m reading it correctly, an incident like this could have been legal grounds to charge the parents with neglect if and only if it was repeated conduct - e.g., they had repeatedly locked the kid out of the house. If not, any judge would through this case out immediately.<p>Note: I&#x27;m not a lawyer and may be entirely wrong.", "time": 1434084777, "type": "comment", "label": "story"}, {"by": "tptacek", "id": 9704140, "kids": [9704178], "parent": 9704125, "text": "<i>To prove the crime of Neglect of a Child, the State must prove the following three elements beyond a reasonable doubt:</i><p><i>1.\t(Defendant)</i><p><i>a.\t[willfully] [by culpable negligence] failed or omitted to provide (victim) with the care, supervision, and services necessary to maintain (victim’s) physical or mental health.</i><p><i>b.\tfailed to make a reasonable effort to protect (victim) from abuse, neglect, or exploitation by another person.</i><p><i>2.\t(Defendant) was a caregiver for (victim).</i><p><i>3.\t(Victim) was under the age of 18 years.</i><p>Florida jury instructions.", "time": 1434085020, "type": "comment", "label": "story"}, {"by": "visarga", "id": 9704178, "parent": 9704140, "text": "Failed to provide &quot;care, supervision, and services&quot; for 17 year olds?<p>I hoped at 14 they declare the kids grown up.", "time": 1434085836, "type": "comment", "label": "story"}, {"by": "melvinmt", "id": 9703920, "parent": 9703663, "text": "In other news today: <a href=\"http:&#x2F;&#x2F;www.kltv.com&#x2F;story&#x2F;29290704&#x2F;police-video-shows-officer-questioning-about-lemonade-stand-permit\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kltv.com&#x2F;story&#x2F;29290704&#x2F;police-video-shows-office...</a>", "time": 1434080827, "type": "comment", "label": "story"}, {"by": "fsloth", "id": 9704088, "parent": 9703663, "text": "While the story is of course fucked up the comments about CPS being some kind brownshirt-nanny corps are perhaps a bit overblown? There are actually people who do more harm than good to their kids and that&#x27;s the reason I suppose these procedures exist.<p>I would say it is the &#x27;common standard&#x27; of what constitues a negligence that is the twisted thing here. Normal kids don&#x27;t need a 24 hour supervisor once they go to school.", "time": 1434083848, "type": "comment", "label": "story"}, {"by": "cpach", "id": 9704199, "parent": 9703663, "text": "From the guidelines:<p><i>”On-Topic: Anything that good hackers would find interesting. That includes more than hacking and startups. If you had to reduce it to a sentence, the answer might be: anything that gratifies one’s intellectual curiosity.<p>Off-Topic: Most stories about politics, or crime, or sports, unless they’re evidence of some interesting new phenomenon. (...)”</i><p>Flagged.", "time": 1434086187, "type": "comment", "label": "story"}, {"by": "drifter89", "id": 9707782, "parent": 9703663, "text": "This literally makes no sense to me. At 11, I used to run, ride my bike for miles by my self. Hell, if I go to my parents neighborhood now. There are kids playing outside all the time. By this logic, I can call the cops, and get the entire neighborhood arrested. Can&#x27;t think of a normal adult that would support this.", "time": 1434134622, "type": "comment", "label": "story"}, {"by": "dudul", "id": 9703830, "kids": [9703901, 9703914], "parent": 9703663, "text": "CPS are disgusting scum.  This kind of story is reported every week. The government is criminalizing parenthood.  Kids can&#x27;t play in their backyard, they can&#x27;t walk to the playground, they can&#x27;t ride their bikes.  Do people remember their childhood?  When did Americans become so socially retarded?", "time": 1434079031, "type": "comment", "label": "story"}, {"by": "kzhahou", "id": 9703901, "kids": [9703949], "parent": 9703830, "text": "These cases are a tiny minority.  CPS deals with real horrifying and tragic situations every day.<p>I&#x27;m actually more shocked that there are prosecutors and even judges that go along with this BS.  I can believe one insane activist CPS worker here and there, but an entire chain of people to back them up??", "time": 1434080579, "type": "comment", "label": "story"}, {"by": "mcphage", "id": 9703949, "kids": [9705456, 9704066], "parent": 9703901, "text": "&gt; CPS deals with real horrifying and tragic situations every day.<p>That&#x27;s what boggles my mind the most.  Every time we hear about CPS they&#x27;re overworked and have to deal with horrors I don&#x27;t even want to imagine.  But how do they have time to waste voluntarily ruining peoples&#x27; lives?", "time": 1434081375, "type": "comment", "label": "story"}, {"by": "Delmania", "id": 9705456, "parent": 9703949, "text": "&gt; But how do they have time to waste voluntarily ruining peoples&#x27; lives?\nPerception bias. The only time you&#x27;ll hear about CPS is in a case like this, when the agent is on a power trip and oversteps his bounds. You never hear about the success stories, where they intervene to save a child, or are successful in getting a family therapy.<p>I can speak from experience here, I have dealt with CPS. When I was notified they would be visiting our house, I did some research. I read the horror stories, and I learned a key detail: CPS is not a policing agency. The threats of taking your children from you and throwing you in jail are idle: only police and judges can do that. When you deal with CPS, only let them in your house if they agree to be recorded. If they refuse, or their supervisor objects, don&#x27;t let them in. Unless they have a warrant, you are under NO obligation to deal with them. (Bear in mind, though, the courts will probably side with CPS)<p>But I digress. My experience with the social worker was that she was just as nervous in dealing with me as I was with her, but she was genuinely interested in understanding and offering assistance. She asked a few questions, held a follow up visit, and that was the end of it.", "time": 1434112828, "type": "comment", "label": "story"}, {"by": "vacri", "id": 9704066, "parent": 9703949, "text": "Well... let&#x27;s not assume that the article has told the whole story. There&#x27;s nothing independently verifiable in it.", "time": 1434083283, "type": "comment", "label": "story"}, {"by": "yequalsx", "id": 9703914, "parent": 9703830, "text": "It started in the early 80s and culminated with the kidnapping of Jacob Weterling.   During this time local and national news portrayed pedophiles and rapists as serious, common threats to children.  There was the absurd McMartin daycare nonsense.  The 80s were a time of relatively high crime and it was during this era that zero tolerance policies became the norm.  It&#x27;s when mandatory minimum sentences became the norm and punishments for crimes became very heavy.<p>As I see things we lost our soul during this time and have not yet recovered it.  At this time if you traveled overseas the first question people would ask is if it was safe.  Justifying laws and policies in the name of safety was the way to get compliance from the citizenry.  It still persists today though people are starting to see the bullshit.  Note that the usual way politicians justify curbs on the internet is by mentioning child pornography.", "time": 1434080768, "type": "comment", "label": "story"}, {"by": "hippich", "id": 9703883, "kids": [9703983, 9703927, 9704086], "parent": 9703663, "text": "I am foreigner, so could someone explain to me - why this is happening? From my discussion similar incidents with other parents it seems like everybody not sure why such attitude exists today. I mean, it should be same adults who have no clue why it is done, pass and enforce these laws?", "time": 1434080363, "type": "comment", "label": "story"}, {"by": "ars", "id": 9703983, "parent": 9703883, "text": "There&#x27;s a reason it&#x27;s on the news, this is not a common thing.", "time": 1434081939, "type": "comment", "label": "story"}, {"by": "dylanjermiah", "id": 9703927, "parent": 9703883, "text": "Democracy, where the intention for &#x27;safety&#x27; and &#x27;protecting children&#x27; is valued above the actual results.", "time": 1434080949, "type": "comment", "label": "story"}, {"by": "randxx", "id": 9704086, "kids": [9704195], "parent": 9703883, "text": "As an American who spends a lot of time in other countries, here&#x27;s my best, shortest attempt to explain:<p>1) The cultural trust and norms in our country are dead. Everything gets the most superficial consideration, there&#x27;s no basis of reasonableness such that even the judge doesn&#x27;t stop the machine, power is so distributed that there&#x27;s no reasonable authority in place, and people like CPS -- who have difficult and challenging and necessary jobs -- don&#x27;t know how to recognize &quot;normal&quot; when they see it. American has no &quot;normal&quot; anymore, and everyone acts based on their greatest fears, informed by our weird local news, NCIS&#x2F;Law&amp;Order fear-mongering mentality. We used to have class divisions that kept things a little normal within class lines, now class divisions have been destroyed such that everyone&#x27;s caught in a race to the bottom.<p>1b) I like to think I&#x27;m not really subject to #1, being an upper middle class white professional... but I live in a relatively urban environment, with a pre-teen child, and there&#x27;s a sense that one socially construed &quot;accident&quot; can send me into a can of worms that can take years to climb out of. So, until then, I&#x27;ll assume I&#x27;m relatively untouchable, because I&#x27;m not really sure what else my option is. I can see relocating, to one of my international anchor points.. permanently, at some point.<p>2) There&#x27;s a strong tinge of &quot;fuck them&quot; or &quot;they have no right&quot; or &quot;they shouldn&#x27;t&quot; in a lot of American interactions now, whether formal or otherwise. People are endlessly bothered by things they aren&#x27;t affected by. I mean, it&#x27;s not everywhere...<p>American culture is now a corporate construct designed to make everyone in its demographic purview feel strongly about something that doesn&#x27;t matter to them, whether it&#x27;s escapees with big dicks or the Kardashians. Radio plays the same 10 songs over and over and over again so you have to hit scan and your radio takes you through stations back to news anchor talking about news that doesn&#x27;t matter. And if you get home and turn on the TV you&#x27;re assaulted by the local news anchors with &quot;news you can trust&quot; or weather reports &quot;you can count on&quot;, and when you ignore that your co-worker at work will just force it down your throat anyway, and you&#x27;ll pretend to go along with it so as to have some minor smidgeon of false rapport, lest you come off as anti-social or.. critical.<p>I was just at a farmer&#x27;s market tonight where kids ran free and cops patted kids on the head and dogs were off leash and people were eating ice cream and yelling and laughing. But it just takes one person, with a spiteful &quot;I&#x27;ll get &#x27;em...&quot; trigger to bring an invisible avalanche into the room. I think it&#x27;s worse in urban areas and in suburban areas, which is why I&#x27;ve been living in medium sized &quot;towns&quot; with urban centers. There seems to be less of that in that kind of neighborly construct. But neither can we talk about places like urban California, suburban California, and rural California in equal terms that cover those places, but also midwestern areas or southern areas or bible belt areas. We&#x27;re not one country anymore, and we have no norms, and people are always told that someone, somewhere is taking shit from them, whether it&#x27;s terrorists, the emboldened, or the entitled. There are each of those, but fewer bothering each of us in actuality. But lots of people can&#x27;t see the normal in the normal anymore, either.", "time": 1434083792, "type": "comment", "label": "story"}, {"by": "Dizzident", "id": 9704195, "kids": [9706020], "parent": 9704086, "text": "It&#x27;s not happening in the US only either...large parts of the EU have to deal with this bureaucracy, and the EU itself is probably the biggest bureaucracy of them all.<p>You&#x27;re mentioning you&#x27;re upper middle class...middle class doesn&#x27;t exist anymore, you&#x27;re a peasant like the rest of us.<p>You&#x27;re right on the other hand about living in rural areas. I moved with my wife and kids from a big city 7 years ago to a small village and never regretted that decision.", "time": 1434086149, "type": "comment", "label": "story"}, {"by": "randxx", "id": 9706020, "parent": 9704195, "text": "&quot;middle class doesn&#x27;t exist anymore&quot;<p>100% agree with that. It&#x27;s an outdated reference, like class and norms.<p>I&#x27;m familiar with the European beauracracy. It&#x27;s not good either, but it seems to cut across a different part of the social infrastructure. It&#x27;s a big bother, makes everything very difficult (like starting a business), but it&#x27;s also tuned towards dealing with the melting pot-ness of the European identity issue. There are serious national and cultural stratifications across Europe that keep people really divided. There&#x27;s no &quot;us&quot; and hasn&#x27;t been for a long time.<p>Our nominal &quot;us&quot;-ness is now eating itself... &quot;American dream&quot; and &quot;American novel&quot; are both concepts that would mean very little to millenials, and those coming up younger.<p>I think what I find most tragic about what feels like the American mindset right now is how much it&#x27;s ignoring how good we still have it, and how much better things could still be if there was a true interest in the greater good. We still don&#x27;t have some of the really unsolvable problems that other countries contend with. Our perspective is blinding.", "time": 1434118949, "type": "comment", "label": "story"}, {"by": "13years", "id": 9703870, "parent": 9703663, "text": "Basically this is the evolution towards Minority Report.  We are destroying the concept of innocent until proven guilty and are convicting people for what might happen instead of what did happen.", "time": 1434080052, "type": "comment", "label": "story"}, {"by": "pg_is_a_butt", "dead": true, "id": 9704089, "parent": 9703663, "text": "fuck all of you idiots.  america is doomed and you are personally to blame.  yes, YOU, idiot.", "time": 1434083853, "type": "comment", "label": "story"}, {"by": "brudgers", "descendants": 2, "id": 9715477, "kids": [9715904, 9715939], "score": 9, "text": "", "time": 1434300090, "title": "Cyber-Physical Systems", "type": "story", "url": "http://cyberphysicalsystems.org/", "label": "story"}, {"by": "jpfr", "id": 9715904, "parent": 9715477, "text": "Norbert Wiener released &quot;Cybernetics: Or Control and Communication in the Animal and the Machine&quot; in 1948. 65 years later, people are still debating the issue and constantly come up with fancy new terms for the subject (i.e. titles for grant proposals).<p>What I take away from this group is that deterministic communication is required for deterministic system behavior. Well, everybody knew that.<p>The only thing that surprised me in the field since a long time is that reasoning about continuous and discrete systems is essentially the same [1].<p>[1] <a href=\"http:&#x2F;&#x2F;symbolaris.net&#x2F;pub&#x2F;freedL.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;symbolaris.net&#x2F;pub&#x2F;freedL.pdf</a>", "time": 1434307557, "type": "comment", "label": "story"}, {"by": "rbc", "id": 9715939, "parent": 9715477, "text": "I&#x27;ve seen this terminology before:<p>Bayne, Jay S. Cyberspatial Mechanics, IEEE Transactions on Systems, Man, and Cybernetics-part b: Cybernetics, Vol. 38, No. 3, June 2008. IEEE.<p>There&#x27;s the beginning of an implementation that&#x27;s part of what I called the Viable System Agent, written in Smalltalk:<p><a href=\"http:&#x2F;&#x2F;ss3.gemstone.com&#x2F;ss&#x2F;VSA.html\" rel=\"nofollow\">http:&#x2F;&#x2F;ss3.gemstone.com&#x2F;ss&#x2F;VSA.html</a><p>Look at the RBC-VSA-CPS category if you are interested.", "time": 1434308095, "type": "comment", "label": "story"}, {"by": "jsnell", "descendants": 0, "id": 9955849, "score": 13, "time": 1438012044, "title": "CPS soup, continuation passing style without nested scopes", "type": "story", "url": "https://wingolog.org/archives/2015/07/27/cps-soup", "label": "story"}, {"by": "jsingleton", "descendants": 0, "id": 11216890, "score": 1, "time": 1457014326, "title": "CPS to prosecute 'trolls' who use fake online profiles", "type": "story", "url": "http://www.bbc.co.uk/news/technology-35712772", "label": "story"}, {"by": "aluciani", "dead": true, "id": 11996113, "score": 1, "time": 1467137733, "title": "What's New in Acropolis 4.7 – Docker, Microsoft CPS and More", "type": "story", "url": "http://next.nutanix.com/t5/Nutanix-Connect-Blog/What-s-New-in-Acropolis-4-7/ba-p/11215#.V3K-rBdO6Sw.hackernews", "label": "story"}, {"by": "joubert", "descendants": 0, "id": 12219711, "score": 1, "time": 1470245051, "title": "Acumen – simulate mathematical models of cyber-physical systems", "type": "story", "url": "http://www.acumen-language.org/", "label": "story"}, {"by": "katiabachko", "dead": true, "id": 12305963, "score": 1, "time": 1471451911, "title": "A Family Matter: Why California's CPS agencies may face class-action lawsuits", "type": "story", "url": "http://read.atavist.com/a-family-matter", "label": "story"}, {"by": "upen", "descendants": 0, "id": 13278147, "score": 1, "time": 1483028634, "title": "Streamlining the Internet of Things and Other Cyber-Physical Systems", "type": "story", "url": "http://sciencebulletin.org/archives/8692.html", "label": "story"}, {"by": "BillPollak", "descendants": 0, "id": 17698319, "score": 1, "time": 1533568570, "title": "Minimum Viable Capability (MVC): Scaling MVP for Cyber-Physical Systems", "type": "story", "url": "https://insights.sei.cmu.edu/sei_blog/2018/08/introducing-the-minimum-viable-capability-strategy.html", "label": "story"}]