{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"LSTM","config":{"units":8,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM1","trainable":true,"batch_input_shape":[null,20,10],"dtype":"float32"}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}}],"keras_version":"tfjs-layers_config 1.0.0","backend":"tensor_flow.js"},"format":"layersConfig-model","generatedBy":"TensorFlow.js tfjs-layersConfig v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./attTemp0_8_4_20.weights.bin"],"weights":[{"name":"lstm_LSTM1/kernel","shape":[10,32],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[8,32],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[160,4],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[4,1],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1],"dtype":"float32"}]}]}