[
  {
    "name": "Noureddine Abidi, Ph.D.",
    "title": "Leidigh Professor, Department of Plant and Soil Science Managing Director; Fiber and Biopolymer Research Institute Fulbright Scholar",
    "email": "noureddine.abidi@ttu.edu",
    "phone": "806-742-5333",
    "website": "www.pssc.ttu.edu",
    "about": "My research encompasses two areas of potential collaborations. First, I am using Fourier Transform Infrared microspectroscopy imaging as a complementary technique to histopathological investigations. This technique allows us to establish functional group distribution maps providing spatial characterization of different biomolecules in a tissue. Successful applications included biochemical changes in brown and white adipose tissues of mice as a result of consumption of high-fat diet as well as whole nematode C. elegans. Second, I am interested in preparation of cellulose and chitin based materials for potential use for wound healing applications.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Awasom (Innocent) Afuh, Ph.D.",
    "title": "Associate Librarian (STEM), Texas Tech University; Libraries Liaison to the Biological Sciences, Chemistry and Biochemistry, and the College of Agriculture",
    "email": "awasom.afuh@ttu.edu",
    "phone": "806-834-2385",
    "website": "https://guides.library.ttu.edu/c.php?g=543228",
    "about": "\nI am a Life Science Librarian with graduate degrees in the Biological Sciences as well as in Scientific and Technical Information (STI) management. I have collaborated in projects in the Biological Sciences as well as Health Sciences in the area of health information access and literacy, public health as well as in scholarly communications and metrics. I bring erudite research skills to a multidisciplinary research team.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Kembra Albracht-Schulte, Ph.D.",
    "title": "Postdoctoral Research Associate, NIOR Lab, Nutritional Sciences Department",
    "email": "kembra.albracht@ttu.edu",
    "phone": "806-742-5270",
    "website": "",
    "about": "Kembra Albracht-Schulte is a postdoctoral research associate in the Nutrigenomics, Inflammation and Obesity Research (NIOR) lab in the Nutritional Sciences Department at Texas Tech University. She earned her B.S. in Exercise Science at Lubbock Christian University and her M.S. in Exercise Science and Ph.D. in Nutrition at Texas Tech University. Her M.S. research focused on the anxiolytic effectiveness of acute sessions of yoga. Under the mentorship of Dr. Naïma Moustaid-Moussa and Dr. Latha Ramalingam, her doctoral research focused on investigating the effects of an omega 3 fatty acid from fish oil, eicosapentaenoic acid (EPA) on liver metabolism and inflammation. A USDA NIFA ELI Predoctoral Fellowship (2017-2019) funded this work. Additionally, her dissertation included collaborative work with Dr. Nishan Kalupahana at the University of Peradeniya, which investigated the association between adiposity, insulin resistance and plasma adipokines with the presence of fatty liver in Sri Lankan adults. Her research interests include understanding mechanisms of bioactive food components and exercise in the treatment/prevention of obesity and related metabolic diseases.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Sharilyn Almodovar, Ph.D.",
    "title": "Assistant Professor, Department of Immunology and Molecular Microbiology",
    "email": "sharilyn.almodovar@ttuhsc.edu",
    "phone": "806-743-1091",
    "website": "",
    "about": "My research focuses on pulmonary vascular complications of HIV infection and how viral proteins reprogram the normal biomolecular landscape in vascular cells leading to pulmonary vascular remodeling and pulmonary hypertension. Laboratory techniques and tools include HIV bioinformatics, standard molecular biology (WB, genomics, etc.), BSL2+ facilities for infectious cell cultures (following strict BSL3 practices) with real time fluorescence cell imager, and BSL2+ animal procedure room (barrier area) to handle HIV-infected humanized mice. Animal room is also equipped with an in vivo cabinet with automatic air filtration system (CoyLabs) for hypoxia studies, small animal ventilators and MPVS Ultra Pressure Volume Loop System with PowerLab software for right heart catheterizations in mice. Techniques applied in this field can certainly be applied to research in other vascular systems as well.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Guillermo A. Altenberg, M.D, Ph.D.",
    "title": "Professor, Department of Cell Physiology and Molecular Biophysics Chair, School of Medicine",
    "email": "g.altenberg@ttuhsc.edu",
    "phone": "806-743-2531",
    "website": "",
    "about": "My laboratory is interested in the mechanisms of transport across biological membranes and in the development of new nanodisc-based technologies for medical and biotechnology applications. Our main target proteins are connexins, the gap-junction-forming proteins, and multidrug-resistance proteins of the ATP-binding cassette (ABC) superfamily, which export a number of chemically dissimilar compounds from the cells. Connexins are essential for cell-to-cell electrical and chemical communication, and are involved in development, as well as in physiological and pathophysiological processes. Expression of multidrug-resistance proteins such as P-glycoprotein (MDR1) confers resistance to chemotherapeutic agents in cancer cells.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Karin Ardon-Dryer, Ph.D.",
    "title": "Assistant Professor, Department of Geosciences, Atmospheric Science Group",
    "email": "karin.ardon-dryer@ttu.edu",
    "phone": "806-834-5214",
    "website": "http://www.atmo.ttu.edu/karinard/",
    "about": "Karin Ardon-Dryer, PhD, is an Assistant Professor in the Department of Geosciences at the Atmospheric Science Group at Texas Tech University. Dr. Ardon-Dryer studies the effect that aerosols have on climate, the environment, and our health. In particular, she takes an interdisciplinary approach and combines field and laboratory work to investigate the interaction between dust storm events and human health. Among others, she is employing an interdisciplinary approach to observe the effects of air pollution particles on health at a single cell level. I am interested to collaborate with people who are interested in air pollution and health effect.\n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Rashmita Basu, Ph.D.",
    "title": "Assistant Professor, Department of Healthcare Management & Leadership",
    "email": "Rashmita.basu@ttuhsc.edu",
    "phone": "806-743-1716",
    "website": "",
    "about": "I am an Assistant Professor in the Department of Healthcare Management & Leadership at Texas Tech University Health Sciences Center. I received my PhD in health economics from Washington State University. My research examines the economics of aging with a particular interest in the areas of long-term care delivery and financing. I started my research career at Baylor Scott&White Health, where I participated in a variety of collaborative and interdisciplinary research projects focusing on population health, care coordination, disease prevention and health promotion. As a health economist, I am always fascinated about demonstrating value of healthcare resources utilized towards promoting efficiency of care delivery and well being of people living within the communities.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Katie Bennett, Ph.D., MB (ASCP) CM, NRCC-CC",
    "title": "Associate Professor, Molecular Pathology & Laboratory Director, Chromatox Diagnostics",
    "email": "katie.bennett@ttuhsc.edu",
    "phone": "(806) 743-4138",
    "website": "https://www.ttuhsc.edu/health-professions/master-of-science-molecular-pathology/faculty.aspx",
    "about": "\nI am an Associate Professor in Molecular Pathology at the Texas Tech University Health Sciences Center, in the School of Health Professions. I am an alumna of TTUHSC, earning my Ph.D. from the Graduate School of Biomedical Sciences at the School of Pharmacy in Amarillo (Pharmaceutical Sciences, 2009). I hold national board certifications in molecular biology and clinical chemistry. Currently, I teach molecular laboratory methods and mentor graduate students in the Molecular Pathology graduate program in Lubbock. As clinical service to the university, I serve as a medical laboratory director in local clinical laboratories. I am the Laboratory Director for Chromatox Diagnostics, which performs confirmatory clinical urine drug testing for pain management and primary care clinics in Lubbock. For eight years, I also directed a molecular diagnostic reference laboratory for the TTU Student Wellness Center. I serve as a study section reviewer for a National Institutes of Health small business SBIR/STTR/R21 Infectious Agent Detection/Diagnostics grant review panel. I have expertise in a variety of molecular methods and instruments that are available in the Molecular Pathology laboratory, including DNA/RNA isolation, real-time PCR, pyrosequencing, digital PCR, and Sanger sequencing. My professional and research interests are focused on molecular diagnostic method design and validation, genetic susceptibility to disease, molecular mechanisms of inflammation, and genetic effects on host-pathogen interactions in infectious disease. I am curious about a variety of biological topics, including genetics in medicine and public health, as well as molecular mechanisms in cellular biology. ",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Yangzom D. Bhutia, D.V.M, Ph.D.",
    "title": "Assistant Professor, Department of Cell Biology and Biochemistry",
    "email": "yangzom.d.bhutia@ttushc.edu",
    "phone": "806-743-1282",
    "website": "",
    "about": "\nPancreatic cancer especially the pancreatic ductal adenocarcinoma (PDAC) is the most lethal of all cancers with a five-year survival rate of less than 5%. Currently, gemcitabine is the standard of care for the locally advanced and metastatic PDAC. FOLFIRINOX and nab-paclitaxel-gemcitabine are also used in the metastatic setting for patients with good performance status. Though it shows a better survival advantage over the gemcitabine monotherapy, toxicity is a big concern. That's why there is an urgent need to discover new drug targets or identify biomarkers that could help in the early diagnosis of the disease and thereby better survival. My lab focuses on nutrient transporters especially the amino acid and the peptide transporters. Since tumor cells have an increased demand for nutrients due to their fast proliferation rate, they upregulate these transporters to their advantage. We are trying to use these transporters as drug targets. Our study uses both in vitro (cancer cell) as well as in vivo (animal) models. Using cancer cell models, we try to understand the mechanism of upregulation of the transporters in cancer cells. In animal experiments we implant tumor cells in syngeneic mice or orthotopically in the pancreas of athymic nude mice and evaluate the efficacy of drugs in attenuating pancreatic cancer growth. Overall, the focus of the lab is to identify proper biomarkers and drug targets that can lead to early detection and better treatment of pancreatic cancer. We are also interested in identifying FDA-approved drugs that could be repurposed as an anti-cancer agent.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Paul Bolls, Ph.D.",
    "title": "Professor, College of Media & Communication; Director, Media Mind Insights Research Group; Associate Director, Center for Communication Research",
    "email": "paul.bolls@ttu.edu",
    "phone": "806-834-7262",
    "website": "",
    "about": "\nMy research expertise is applying Media Psychophysiology to study how individuals mentally process and respond to media content and technologies. Media Psychophysiology is a paradigm for recording physiological responses (e.g. heart rate, skin conductance, facial electromyography) that are indicators of psychological responses related to attention and emotion. I have conducted research across multiple forms of media content and technologies but have a specific interest in using Media Psychophysiology to optimize media for positive effects on health and wellness. I am a Neuromarketing consultant who has worked with industry partners using Media Psychophysiology to test and optimize messages. I am currently developing a model for effective health communication that is designed to investigate how physical changes to the brain and body due to chronic health conditions impact the way the human mind processes health information and campaign messages. I am developing research proposals in the areas of diabetes and opioid use that will apply this model in developing, testing, and optimizing messages in these areas. I am interested in collaborating with colleagues who are interested in applying this research approach in developing patient education materials and persuasive health campaigns.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Sarai Brinker, Ph.D.",
    "title": "Instructor, Musicology",
    "email": "s.brinker@ttu.edu",
    "phone": "806-317-4460",
    "website": "",
    "about": "\nMy research project is called CRADLE, which stands for Creative Arts During prenatal Education. We currently offer prenatal education at two sites and are hoping to extend the reach of the classes for additional populations. The classes we offer integrates arts practices, such as painting and creating lullabies, into recommended prenatal education. The goal of the class is to pair pregnant women with professional artists in order to create art while supporting maternal health, aid in child development, and strengthen bonds within a cohort of pregnant women among each other and with their babies.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Jean-Michel Brismée, P.T, S.C.D.",
    "title": "Professor, Doctor of Science Program in Physical Therapy",
    "email": "jm.brismee@ttuhsc.edu",
    "phone": "806-743-3243",
    "website": "",
    "about": "\nResearch focused on investigating ways for clinicians to rehydrate the intervertebral disc using movements and positions of the spine to decrease spinal shrinkage associated with aging.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Toby Brooks, Ph.D., LAT, ATC, CSCS",
    "title": "Associate Professor, TTUHSC Master of Athletic Training Program",
    "email": "toby.brooks@ttuhsc.edu",
    "phone": "806-743-2261",
    "website": "",
    "about": "\nDr. Toby Brooks is an Associate Professor in the Department of Rehabilitation Sciences at the TTUHSC. His research interests include early youth sports specialization and exercise interventions to reduce the risk of non-contact knee injuries in female athletes.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Amanda Brown, Ph.D.",
    "title": "Assistant Professor, Department of Biological Sciences",
    "email": "amanda.mv.brown@ttu.edu",
    "phone": "806-834-0984",
    "website": "",
    "about": "\nMy research examines how microbes interact to form stable partnerships that facilitate or limit processes such as species invasions, disease outbreaks, or biomass production. This research is significant because microbes are ubiquitous, occurring in almost every habitat on Earth, including in and on multicellular organisms. While much of the past two hundred years of microbial research has focused on pathogens, we now know that many host-associated microbes have evolved to serve biochemically fundamental processes In their hosts. Familiar examples include organelles such as mitochondria and chloroplasts and beneficial microbiomes of humans.\nI focus on:\nTo infer function and functional changes in microbial communities, we use metagenomics, transcriptomics, miRNomics, bioinformatics, and fluorescence microscopy. My lab develops new lab methods and computer algorithms for microbiome analysis. Students trained in my lab will gain cutting-edge skills relevant to careers in biotechnology, bioinformatics, medicine, agriculture, and other fields.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Theresa Byrd, Ph.D.",
    "title": "Associate Dean and Chair, Department of Public Health",
    "email": "theresa.byrd@ttuhsc.edu",
    "phone": "806-743-1195",
    "website": "",
    "about": "\nTheresa Byrd, Ph.D., is Associate Dean and Chair of the Department of Public Health in the Graduate School of Biomedical Sciences at Texas Tech University Health Sciences Center. Dr. Byrd received a BSN from the University of Arizona and worked as a public health nurse for several years in the Tucson area before obtaining her MPH from UCLA. She worked in Cd. Juarez, Chihuahua, Mexico for three years with Proyecto Verdad serving very marginalized populations with basic public health needs, and then went to Houston where she received a Dr.PH in Behavioral Sciences and Health Education from the University of Texas School of Public Health, where she worked as a faculty member for almost 20 years. Dr. Byrd's research is focused on cancer prevention and screening, especially in the area of cervical and colorectal cancer. She led the development and testing of the AMIGAS program, an intervention to increase cervical cancer screening in Hispanic populations which has been adopted by the CDC as a recommended intervention. Her research has been funded by NCI, CDC and the Cancer Prevention Research Institute of Texas (CPRIT).\n  ",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Guofeng Cao, Ph.D.",
    "title": "Assistant Professor, Department of Geosciences",
    "email": "guofeng.cao@ttu.edu",
    "phone": "806-834-8920",
    "website": "",
    "about": "\nGuofeng Cao is an Assistant Professor in the Department of Geosciences with expertise in geographic information science, spatial statistics and Big Data. He is interested in integrating advances in geospatial technologies (e.g., GIS, GPS, remote sensing and location-based social media) in improving the understanding of environmental health and community health dynamics. Related research activities include digital epidemiology, high resolution mapping of air pollutant exposure and the associated health effects.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Perry L. Carter, Ph.D.",
    "title": "Associate Professor, Department of Geography",
    "email": "perry.carter@ttu.edu",
    "phone": "",
    "website": "",
    "about": "\nI am a social/cultural geographer whose primary research focus has been on race and racialized spaces. Over the past six years I have been drawn through my graduate students into the sub-geographic field of environmental racism and environmental justice. \"Urban Landscape as Mirror of Ethnicity: Trees of the South Plains,\" by Sorrensen, Carter, and Phelps (Urban Geography, 36(7), 2015) springs from my student, Jack Phelps, master's thesis on tree cover in the city of Lubbock. This study found that tree cover is less dense in the city's Hispanic neighborhoods. This is because most of these neighborhoods are located near or within industrial corridors that are devoid of trees. Here lack of tree cover reflects co-location with heavy industry. \"Spatial Environmental Inequality in Lubbock, Texas,\" by Post, Carter, and Sorrensen, (Current Research Journal of Social Sciences and Humanities, 1(1), 2018) once again uses Lubbock as a case study. This work originates from my student Jason Post's master's degree work. It found that toxic release sites in the city are primarily located near or within African-American and Hispanic communities. The findings of this study found their way into a recent Lubbock Avalanche Journal article: \"North and East Lubbock residents share concerns of living near environmental hazards.\" Currently I am working with Emily Glaeser on her master's degree research on how the Deaf community of Austin, Texas accesses healthcare. In addition to the work described here, I have skills in spatial analysis, statistics, data science, survey research, and qualitative methods.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Gordon Christopher, Ph.D.",
    "title": "Associate Professor, Whitacre College of Engineering Department of Mechanical Engineering",
    "email": "gordon.christopher@ttu.edu",
    "phone": "806-834-4725",
    "website": "http://www.myweb.ttu.edu/gchristo/",
    "about": "\nDr. Christopher has been is an Associate professor in the Department of Mechanical Engineering at Texas Tech University, where he has worked since 2011. He received a BS in Mechanical Engineering (2002) and a BA in Film (2003) from Columbia University. He attended Carnegie Mellon and graduated with a PhD in Mechanical engineering and a MS in Chemical Engineering in 2008. Afterwards, he spent 2 years in the Polymers Division of the National Institute of Standards and Technology as a NRC Postdoc. His research focuses on the development on study of complex fluids, complex interfaces, and flows of these materials through the development of novel techniques, including microfluidics, interfacial rheology, and bulk rheology. Since beginning work at Texas Tech, he has been named a Whitacre Research Fellow and won the TA Distinguished Young Rheologist award.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Ioana A. Coman, Ph.D.",
    "title": "Assistant Professor, Department of Public Relations;",
    "email": "ioana.coman@ttu.edu",
    "phone": "806-834-0936",
    "website": "",
    "about": "I am an Assistant Professor in the College of Media & Communication, and I also serve as a Faculty Affiliate for the Thomas Jay Harris Institute for Hispanic and International Communication. My research uses multi-disciplinary and multi-cultural approaches to examine crisis and risk communication and media, with an emphasis on new media and social media, via qualitative and mixed methods. I am interested in how different actors (officials, organizations/institutions, media/journalists, publics, etc.) engage and interact in risk/crisis communication via different platforms, within different contexts (health outbreaks; disasters; terrorist attacks; health/disaster prevention, etc.) and at different levels (local, national, international). Other areas of interest include research on issues related to international communication, digital media (public sphere), public relations, journalism (misinformation issues) and scholarship of teaching and learning. Currently I am working on an international project related to measles vaccine crisis and risk communication.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Kelli Cargile Cook, Ph.D.",
    "title": "Professor and Founding Chair of the Professional Communication Department",
    "email": "kelli.cargile-cook@ttu.edu",
    "phone": "806-834-2883",
    "website": "",
    "about": "Kelli Cargile Cook is a Professor and Founding Chair of the Professional Communication Department at Texas Tech University. Prior to this appointment, she served as a Professor of Technical Communication and Rhetoric (TCR) from 2009-2018. Her research interests include program development and assessment, online education, online training, and user-experience design. She has co-edited two collections on online education in professional and technical communication: Online Education 2.0: Evolving, Adapting, and Reinventing Online Technical Communication (2013) and Online Education: Global Questions, Local Answers (2005). The 2005 collection received the NCTE Award for Excellence for Best Collection in Technical and Scientific Communication, 2006. Her scholarship has appeared in Technical Communication Quarterly, Technical Communication, Journal for Technical Writing and Communication, Programmatic Perspectives, and Business Communication Quarterly.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Chiquito Crasto, Ph.D.",
    "title": "Research Associate Professor, Center for Biotechnology and Genomics",
    "email": "chiquito.crasto@gmail.com",
    "phone": "806-834-5448",
    "website": "https://www.depts.ttu.edu/biotechnologyandgenomics/about/staff/chiquito.php",
    "about": "\nDr. Crasto, a recipient of the Government of India National Merit Scholarship, graduated from the University of Mumbai and the Indian Institute of Technology with degrees in Chemistry. He has a Master's degree in Chemistry from the Ohio State University and a doctorate in Chemistry from the University of New Orleans. Dr. Crasto has postdoctoral training at the Fox Chase Cancer Center and the Yale University School of Medicine. Dr. Crasto has been the PI on an NIH grant and several intramural grants. Dr. Crasto also has extensive teaching experience--having taught Chemistry, Biology, Biochemistry, and Proteomics. Dr. Crasto has spoken at several national and international conferences, has several peer-reviewed publications and is the editor of two books.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Jennifer A. Cross, Ph.D.",
    "title": "Associate Professor, Department of Industrial, Manufacturing & Systems Engineering",
    "email": "Jennifer.Cross@ttu.edu",
    "phone": "806-742-3543",
    "website": "https://www.depts.ttu.edu/imse/faculty/jennifer_cross/index.php",
    "about": "\nResearch Interests: Organizational improvement methods (e.g., Lean, Six Sigma); Performance measurement; Teams",
    "institution": "Texas Tech University"
  },
  {
    "name": "Glenn Cummins, Ph.D.",
    "title": "Associate Dean for Research and Grants, College of Media & Communications; Director, Center for Communication Research Associate Professor, Department of Journalism and Creative Media Industries",
    "email": "glenn.cummins@ttu.edu",
    "phone": "806-834-3117",
    "website": "",
    "about": "\nDr. Glenn Cummins is Associate Dean for Research and Grants in the College of Media & Communication and serves as director of the college's Center for Communication Research. He has methodological expertise in communication message testing using a variety novel research tools or approaches, including eye tracking, continuous response measurement (or dial testing) of video content or in-person presentations, psychophysiology, or reaction time. His research explores how audiences respond to specific structural and content aspects of media messages. Through his administrative appointments, Dr. Cummins also works to build partnerships with scholars from across campus, as well as external organizations. His research has increasingly explored the role of communication and media messages in partnership with scholars working in a variety of disciplines and topics, including agricultural sciences, climate and the environment, and health and obesity. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Tim Dallas, Ph.D.",
    "title": "Associate Dean, Graduate School and Professor Professor, Department of Electrical and Computer Engineering",
    "email": "tim.dallas@ttu.edu",
    "phone": "806-834-6856",
    "website": "",
    "about": "\nTim Dallas, PhD is an Associate Dean of the Graduate School and Professor of Electrical and Computer Engineering at Texas Tech University. As an Associate Dean, he oversees internal and external graduate fellowship programs. Dr. Dallas' research includes developing MEMS-based education and research tools. Currently, he is working with colleagues in the College of Education and the Office of International Affairs on the development of the Solar Powered Digital Classroom in a Box. This technology has been deployed to off-the-grid locations in Africa to provide much needed educational content to entire classrooms using picoprojectors. In 2008, he established Class on a Chip, Inc. to commercialize an array of micro-experimental devices for use in engineering, physics, and MEMS classes. In 2014, he established a new class in the Whitacre College of Engineering, Technology Start-up Lab, which takes students through a process to develop their own technology projects for commercialization. The Tech Start-up Class partners with a class in business to form student development teams that jointly work on innovative product ideas.\nDr. Dallas has served as the principal investigator for a National Science Foundation sponsored Research Experience for Undergraduates Site, a Course Curriculum and Laboratory Improvement (CCLI) project, and a Scholarships in STEM (S-STEM) program. He has also been funded by the Keck and Welch Foundations for MEMS-based education technologies. He served for three years as an Associate Editor for IEEE Transactions on Education. He is a Senior Member of IEEE and a Fellow of TTU's STEM-CORE.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Mark Dame, MHA, CPHRM, FACHE",
    "title": "Director & Assistant Professor, Health Care Management",
    "email": "mark.dame@ttuhsc.edu",
    "phone": "806-743-2577",
    "website": "",
    "about": "\nMark Dame, MHA, CPHRM, FACHE has over 30 years of leadership experience in healthcare administration and business and has served as a TTUHSC Assistant Professor and BSHM Program Director and as an executive with the TTU Physicians and the School of Health Professions Speech and Hearing Clinic. He earned his MHA from Indiana University and is currently completing his doctorate at Texas Tech in healthcare administration and instructional technology. He has been published, has served on various ACHE and ASHRM committees and has been a recipient of multiple awards. He served on the ACHE publications' editorial board, ASPEN's editorial board, the editorial board for the award winning publication, the ASHRM Journal, and on the Forum editorial board. He has served on several public and private boards.\nIn 2017 he was an invited inductee to Phi Kappa Phi. For ACHE, he serves on the Regents Advisory Committee. He continues as a certified healthcare risk manager while serving as faculty in the healthcare administration program at TTUHSC. He also serves on the Global Health Consortium and many academic performance improvement projects. He assists other faculty with their instructional design and serves as a research expert for the TTUHSC Clinical Research Institute.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Tommy Dang, Ph.D.",
    "title": "Assistant professor, Department of Computer Science, Whitacre College of Engineering; Director of Interactive Data Visualization Lab (iDVL)",
    "email": "tommy.dang@ttu.edu",
    "phone": "806-319-3156",
    "website": "Websites:",
    "about": "Dr. Tommy Dang is an assistant professor of computer science at Texas Tech University. His research focuses on big data visualization and visual analytics, 3D modeling, and virtual reality. Dr. Dang has previously been a post-doc on a DARPA-funded project on biological network visualization at the Electronic Visualization Lab at the University of Illinois at Chicago which focuses on advanced virtual reality, notably the CAVE2™ hybrid reality environment and the SAGE2™ scalable amplified group environment. In his research, he studied the visual characterizations of high dimensional data (funded by NSF: Visually-Motivated Characterizations of Point Sets Embedded in High-Dimensional Geometric Spaces). Building upon a systematic approach of visual specification and characterization, the Dr. Dang's ambition is to effectively connect the three components: Big Data - Visual Interface - Users.\nThe interactive Data Visualization Lab (iDVL) focuses on developing methods and tools for analyzing, visualizing, and interacting with massive, dynamic, and ambiguous data arose from various application domains. iDVL research efforts explore the novel marriage of human-computer interaction, scientific and information visualization, computer animation, and machine learning. iDVL moves beyond traditional computing environments by experiencing interactive visualization techniques on mobile devices as well as within immersive virtual reality environments. Currently, Dr. Dang is the Director of the laboratory and leading four Ph.D. students, two Master students, and two undergraduate students.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Doug Dendy, PT, ScD",
    "title": "Assistant Director & Assistant Professor, Clinical Education, Department of Physical Therapy",
    "email": "doug.dendy@ttuhsc.edu",
    "phone": "806-743-3236 (Office)",
    "website": "",
    "about": "Doug Dendy is an Assistant Professor and Assistant Director of Clinical Education for the Texas Tech University Health Sciences Center, Department of Physical Therapy. Academically, he teaches courses in pediatrics, human development, orthotics, and assistive technology. In addition, he has multiple certifications and licensures associated with hippotherapy, instrument-assisted soft tissue mobilization (IASTM), Schroth C2 Barcelona Scoliosis Physical Therapy School (BSPTS) for scoliosis, neurodevelopmental techniques, and qualitative assessment of general movement. He still works clinically in pediatric populations: ECI, outpatient, and hospital settings. Current, research areas he is working include scoliosis with Schroth, hippotherapy with early intervention children, injury prevention related to female athletes, and innovations in teaching.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Emily Dhurandhar, Ph.D.",
    "title": "Assistant Professor, Department of Kinesiology and Sport Management",
    "email": "emily.dhurandhar@ttu.edu",
    "phone": "806-834-6556",
    "website": "www.depts.ttu.edu/ksm/research/EmilyDhurandhar.php",
    "about": "Dr. Dhurandhar conducts research on the psychosocial and dietary factors that influence energy balance and weight management in humans with obesity. She currently directs the Dhurandhar Human Energetics Laboratory where she has been an independent investigator since 2016. Her laboratory focuses on understanding:  ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Nik Dhurandhar, Ph.D.",
    "title": "Helen DeVitt Jones Endowed Chair Chairman, Department of Nutritional Sciences; Professor, Department of Nutritional Sciences",
    "email": "nikhil.dhurandhar@ttu.edu",
    "phone": "806-742-5270",
    "website": "",
    "about": "\nDr. Dhurandhar is a physician, nutritionist and biochemist by training. He has been involved with obesity treatment and research for 35 years and has treated more than 15,000 patients for obesity using lifestyle therapy as well as medication. His research focuses on molecular biological aspects of obesity and diabetes. He especially examines the impact on obesity due to microbes and clinical treatment of obesity. Along with colleagues, he discovered that infections due to two adenoviruses cause obesity in animal models and show a strong association with human obesity. He coined the term Infectobesity to describe the phenomenon, which is now being studied by many research groups globally. Dr. Dhurandhar's group is currently focused on developing an anti-diabetic agent from a protein of an adenovirus. In this field of study, he has received 10 US patents and 33 international patents and was inducted to the National Academy of Inventors as a senior member of Texas Tech University chapter in 2017. Dr. Dhurandhar conducts clinical trials in obesity (nutritional, behavioral and pharmacological treatment). He would like to draw attention to the Nutrition and Metabolic Health Initiative (NMHI), which is an initiative supported in TTU strategic plan) of the department of Nutritional Sciences (College of Human Sciences) which provides obesity treatment, facilities and infrastructure for clinical nutrition research, student training, and outreach activities. NMHI is rapidly expanding, currently working with various entities on TTU and TTU-HSC campus and remains interested in further collaborative projects of various types.",
    "institution": "Texas Tech University"
  },
  {
    "name": "David L. Doerfert, Ph.D.",
    "title": "Associate Dean, Texas Tech University Graduate School; Associate Professor, Department of Agricultural Education and Communications",
    "email": "david.doerfert@ttu.edu",
    "phone": "806-834-4477",
    "website": "www.gradschool.ttu.edu",
    "about": "\nMy program of research is focused on the development of effective digital intelligence and science information systems for agriculture. This research program weaves together:",
    "institution": "Texas Tech University"
  },
  {
    "name": "Dongping Du, Ph.D.",
    "title": "Assistant Professor, Department of Industrial, Manufacturing and Systems Engineering",
    "email": "dongping.du@ttu.edu",
    "phone": "806-834-7388",
    "website": "http://myweb.ttu.edu/ddu/",
    "about": "\nDr. Du's research develops advance technologies and methodologies in modeling and simulation, data mining and image analysis, system control and optimization for cardiac risk stratification, medical decision making, and postoperative management. Some specific applications include: image segmentation and machine learning to assist cardiac diagnosis, modeling and simulation of cardiac electrophysiology and electromechanics to aid treatment design, and remote monitoring and control to promote home-based cardiac rehabilitation. Dr. Du's is open to all research opportunities that demand her expertise. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Stacy Elko, M.F.A.",
    "title": "Associate Professor, Printmaking, and Area Lead, School of Art",
    "email": "s.elko@ttu.edu",
    "phone": "806-834-5841",
    "website": "",
    "about": "\nStacy Elko is a professional artist interested in interdisciplinary art forms that combine printmaking, papermaking and three-dimensional forms in works that addresses social and environmental issues. She received her MFA in printmaking from Indiana University after a 10-year residence in Morocco, North Africa as a working artist and Peace Corps volunteer. She also received a certificate in Serious Game Design from Michigan State, a BFA from Kent State and has lived in Poland, taught in Spain and studied in Venice. Stacy's artwork has been featured in many group, solo exhibits and installations across the United States, Mexico, Morocco and Australia. Stacy's current research is with the Arts in Medicine initiative of the TTU-TCVPA. Her projects include research in post stroke aphasia patient provider communication, facial recognition with persons with ASD, and PSA use with non-medical use of prescription drugs. Her collaborators are: Dr. Melinda Corwin (Speech Hearing Pathology, TTUHSC), Dr. John Velez (School of Media, IU), Dr. Justin Keene (Media & Communication TTU) Professor Carla Tedeschi (PI TTU Art), Dr. Tobias Kroll (Speech Hearing Pathology, TTUHSC), and Dr. Sherry Sancibrian (Speech Hearing Pathology, TTUHSC)",
    "institution": "Texas Tech University"
  },
  {
    "name": "Paul Egan, Ph.D.",
    "title": "Assistant Professor and Lab Director, Mechanical Engineering",
    "email": "paul.egan@ttu.edu",
    "phone": "806-834-2583",
    "website": "https://paul-egan.com",
    "about": "\nPaul Egan leads engineering design research at the intersection of medicine, mechanics, and manufacturing. Paul is a tenure-track assistant professor in Mechanical Engineering at Texas Tech University. His lab group uses computational modeling, simulation, and design to create innovative medical technologies, with an expertise in 3D polymer and bioprinting. Paul's collaboration interests include personalized nutrition, muscle, bone, tissue engineering, surgical training, virtual reality, 3D printing, mechanics, design thinking, education, and entrepreneurship.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Taylor Ernst, M.A.",
    "title": "Research Aide for the Art Division",
    "email": "taylor.ernst@ttu.edu",
    "phone": "806-834-8609",
    "website": "",
    "about": "\nTaylor Ernst currently works as the research aide for the Art Division at the Museum of Texas Tech University. She earned her B.F.A. in Visual Studies with an emphasis in ceramics in 2011 and her Master of Arts in Heritage and Museum Sciences in 2017. Currently, Ernst's research focuses on X-ray techniques used to explore the possibility of an image underneath the visible layer of paint. Artists, especially in the early 1900s, would create an image, then paint over part of the image to create a new piece. One such artist is N.C. Wyeth, an American artist and illustrator. The Museum of Texas Tech University collection holds several pieces by N.C. Wyeth that are excellent candidates for this technique. \n ",
    "institution": "Museum of Texas Tech University"
  },
  {
    "name": "Stephen T. Fife, Ph.D., LMFT",
    "title": "Associate Professor, Department of Community, Family, and Addiction Sciences; Couple, Marriage, and Family Therapy Program",
    "email": "stephen.fife@ttu.edu",
    "phone": "806-834-7580",
    "website": "http://www.depts.ttu.edu/hs/cfas/fife.php",
    "about": "\nThe TTU Department of Community, Family, and Addiction Sciences (CFAS) is collaborating with the University Medical Center's (UMC) Pediatric Trauma Center and the TTU Clinical Psychology program to establish a trauma screening protocol and follow-up intervention for all UMC pediatric trauma patients and family members of trauma-exposed children. The primary goal of this interdisciplinary collaboration is to establish an effective comprehensive screening and intervention program to reduce acute stress disorder (ASD) and post-traumatic stress disorder (PTSD) in pediatric trauma patients and their families. In addition to providing clinical services, the collaboration includes a significant research component to evaluate how well the screening protocol and treatment approach, including the use of telehealth services, meets the mental health needs of local pediatric trauma patients and families, as well as those from rural communities in West Texas and Eastern New Mexico. CFAS Faculty members' areas of expertise and research interests include medical family therapy, integrative care, telemental health, the treatment of ASD and PTSD in pediatric trauma patients and family members, and community-based participatory research (CBPR). \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Vadivel Ganapathy, Ph.D.",
    "title": "Department Chair, Department of Cell Biology and Biochemistry",
    "email": "vadivel.ganapathy@ttuhsc.edu",
    "phone": "806-743-2518",
    "website": "",
    "about": "\nDr. Vadivel Ganapathy has been teaching gastrointestinal physiology for the medical students for more than 20 years, which includes topics such as digestion and absorption and liver physiology. His primary research interest for the past 40 years has been on nutrient transporters that are expressed in tissues such as the intestinal tract, placenta, liver, and retina. To date, he has published 475 full-length research articles and 30 book chapters. This includes chapters on Digestion and Absorption in gastroenterology textbook series such as the Textbook of Gastroenterology (edited by Yamada) and the Physiology of the Gastrointestinal Tract (edited by Johnson). In recent years, he has become interested in the iron-overload disease hemochromatosis.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Haiwen Ge, D.Sc.",
    "title": "Instructor, Department of Mechanical Engineering",
    "email": "haiwen.ge@ttu.edu",
    "phone": "608-695-5372",
    "website": "http://www.myweb.ttu.edu/hge/",
    "about": "\nComputational fluid dynamics (CFD), multiphase flow, reactive flow, thermodynamics, heat transfer, optimization, data analysis, internal combustion engines, gas turbine, furnace, soot emission, upper human respiratory system, respiratory drug delivery.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Nadezhda German, Ph.D.",
    "title": "Assistant Professor, Department of Pharmaceutical Sciences",
    "email": "nadezhda.german@ttuhsc.edu",
    "phone": "806-414-9190",
    "website": "",
    "about": "\nMy research group applies traditional and contemporary medicinal chemistry drug design techniques to develop therapeutic agents to treat: \nIn particular, we have received an NIH funding for optimization of penfluridol-derived chemicals as anticancer agents followed by their evaluation in in vivo models. Our CNS projects have resulted in three patent applications (under revision) and obtained a foundation's funding for evaluating our lead compounds in the corresponding in vivo models. Finally, we have developed compounds capable of slowing the development of bacterial resistance in vitro. In addition, we work on developing of pharmacological tools that allow elucidating mechanisms involved in developing of dyskinesia as a side effect of the CNS-related therapeutical treatments.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "DJ Gililland Jr., Ed.D., LAT, ATC",
    "title": "Assistant Professor, TTUHSC Master of Athletic Training Program",
    "email": "dj.gililland@ttuhsc.edu",
    "phone": "806-743-2091",
    "website": "",
    "about": "\nCurrent research activities, Interprofessional Case Competition Integration within a College of Health Sciences, Problem-Based Learning within the Athletic Training Clinical Education Framework, Student Reported Learning Outcomes in Clinical Education, Bridging the Gap Between Theory and Practice within Athletic Training Clinical Education.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Zijian Harrison Gong, Ph.D.",
    "title": "Assistant Professor, Department of Advertising",
    "email": "harrison.gong@ttu.edu",
    "phone": "806-281-0965",
    "website": "",
    "about": "\nZijian Harrison Gong (Ph.D., Texas Tech University) is an assistant professor in the Department of Advertising at Texas Tech University. His research focuses on motivated processing of media to understand how message execution elements such as design and layout impact selective attention, recall, and attitude formation, and how source and message factors impact the persuasiveness of media content. Most of his research applied eye-tracking, continuous responses, psychophysiological measures, or survey methods. Practically, his research findings offer tangible insights that help media practitioners enhance the persuasiveness of their messages. His research papers have been published in a range of leading journals in media and communication, including Communication Monographs, Media Psychology, and the Journal of Broadcasting and Electronic Media.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Lan Guan, Ph.D.",
    "title": "Professor at the Department of Cell Physiology and Molecular Biophysics & Co-Director of the Center for Membrane Protein Research",
    "email": "lan.guan@ttuhsc.edu",
    "phone": "806-743-3102",
    "website": "http://www.ttuhsc.edu/medicine/cell-physiology-molecular-biophysics/faculty/guan/",
    "about": "\nLan Guan is a Professor at the Department of Cell Physiology and Molecular Biophysics (effective September 2019) and Co-Director of the Center for Membrane Protein Research at the School of Medicine of Texas Tech University Health Sciences Center, Lubbock, TX. She has received extensive training with rich experience in the fields of membrane protein structure biology and transporter biochemistry/biophysics. Her laboratory uses multiple biochemical and biophysics techniques, including X-ray crystallography, isothermal titration calorimetry, fluorescence spectroscopy, and tracer flux assays, in combination with site-directed mutagenesis and suppressor isolations, to characterize transport mechanisms of cation-coupled nutrient transporters. Dr. Guan has directed and completed multiple State-funded, NSF-funded, and NIH-funded research grants, and currently funded by two NIH research grants (RO1 and R21).\n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Nathaniel Hall, Ph.D.",
    "title": "Assistant Professor, Department of Animal and Food Science",
    "email": "nathaniel.j.hall@ttu.edu",
    "phone": "806-834-8924",
    "website": "https://www.depts.ttu.edu/afs/people/nathan-hall/",
    "about": "\nI broadly study canine health and behavior and focus primarily on developing and enhancing the use of canines as biological detectors. Canines are deployed worldwide as biological detectors of narcotics, military explosives, improvised explosives, and more recently, cancer. My lab focuses on measuring and validating canine olfactory abilities, as well as developing new training procedures to enhance detection capabilities. I am interested in collaborations that will help test, measure, and enhance the performance of canines as biological detectors as well improve the health and welfare of dogs.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Juske Horita, Ph.D.",
    "title": "Professor, Department of Geosciences",
    "email": "juske.horita@ttu.edu",
    "phone": "806-834-7027",
    "website": "http://myweb.ttu.edu/juhorita/",
    "about": "\nNatural stable isotope tracers of organic and biological compounds\nOur group has developed and been using state-of-the-art and innovative analytical techniques for naturally occurring stable isotopes of light elements (H- 1H and 2H; C - 12C and 13C; O - 16O, 17O, and 18O; N – 14N and 15N) of organic and biological molecules, based on mass spectrometry and Nuclear Magnetic Resonance spectroscopy. These techniques can determine small variations in the stable isotope compositions of these elements, either as bulk molecules or for different H/C groups within a given molecule. Applications of these techniques to medical sciences could include biological uptake/incorporation of elements, metabolic pathways and others.\nNatural stable isotope tracers of organic and biological compounds\nOur group has developed and been using state-of-the-art and innovative analytical techniques for naturally occurring stable isotopes of light elements (H- 1H and 2H; C - 12C and 13C; O - 16O, 17O, and 18O; N – 14N and 15N) of organic and biological molecules, based on mass spectrometry and Nuclear Magnetic Resonance spectroscopy. These techniques can determine small variations in the stable isotope compositions of these elements, either as bulk molecules or for different H/C groups within a given molecule. Applications of these techniques to medical sciences could include biological uptake/incorporation of elements, metabolic pathways and others.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Morgan E. House, Ph.D., MBA, LNFA",
    "title": "Assistant Professor, Bachelor of Science in Healthcare Management",
    "email": "morgan.house@ttuhsc.edu",
    "phone": "806.743.3567",
    "website": "",
    "about": "\nDr. Morgan E. House, Ph.D., MBA, LNFA focuses her academic research on geriatric care services and resident care needs. Dr. House also holds a Master of Business Administration (MBA) and a Texas Nursing Home Administrators License to operate long-term care facilities. Morgan keeps current in the field of long-term care through many hours of continuing education and service in West Texas nursing homes. Bringing over a decade of teaching experience in both undergraduate and graduate health care management and leadership courses; that include: healthcare marketing, healthcare law and ethics, healthcare leadership, long term care management, quality assurance and risk management, State and Federal regulatory requirements in long term care, strategic management, and issues in gerontology for leaders in healthcare. The research interests of Dr. House include an emerging topic of long-term care facility resident sexuality and the associated educational needs of healthcare managers in effectively and adequately dealing with residents, families, and facility staff. The identified needs of residents, family and facility staff have heretofore been ignored. Dr. House's recent research has identified specific educational needs of affected parties in this area that she is now addressing through a dynamic curriculum.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Yang Hu, Ph.D., P.E.",
    "title": "Research Assistant Professor, Department of Plant and Soil Science, Fiber and Biopolymer Research Institute",
    "email": "yang.hu@ttu.edu",
    "phone": "806-834-7518",
    "website": "",
    "about": "\nI have many years of experience in engineering diverse polymeric biomaterials applied to medicals, pharmaceuticals, environment, and electrics. Specifically, in recent years, highlights of my research are the application of \"smart\" concept to design and synthesize various biomaterials and devices, containing but not limited to membranes, hydrogels, aerogels, tissue scaffolds, nanoparticles, and single-crystal biomaterials. As PI or co-PI on several national and local grants of China and USA, I laid the groundwork for exploring the mechanism behind wound healing towards the goal of healing without scarring using engineered smart membrane materials. Several major focuses of my research and potentials for collaborations:\n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Ram Iyer, Ph.D.",
    "title": "Professor, Department of Mathematics and Statistics",
    "email": "ram.iyer@ttu.edu",
    "phone": "806-834-3872",
    "website": "",
    "about": "\nCurrent Research Area: Optometry and Opthamology\nCorneal ectatic disorders - a group of uncommon, non-inflammatory, eye disorders characterized by the bilateral thinning of the cornea - are due to the weakening of the inner layers of the cornea. The accurate diagnosis of corneal ectatic disorders such as Keratoconus, Keratoglobus, and Pellucid Marginal Degeneration (PMD) is very important in the prognosis and treatment of these conditions. Forme fruste or subclinical keratoconus is a condition experienced by patients with stable corneas for whom the disease has not yet progressed into either keratoconus or PMD. The diagnosis of conditions that could lead to significant ectasia after LASIK surgery has been identified by the National Eye institute as a priority area. Since 2010, Prof. Iyer and his team have been working on:\nCurrent Research Area: Optometry and Opthamology\nCorneal ectatic disorders - a group of uncommon, non-inflammatory, eye disorders characterized by the bilateral thinning of the cornea - are due to the weakening of the inner layers of the cornea. The accurate diagnosis of corneal ectatic disorders such as Keratoconus, Keratoglobus, and Pellucid Marginal Degeneration (PMD) is very important in the prognosis and treatment of these conditions. Forme fruste or subclinical keratoconus is a condition experienced by patients with stable corneas for whom the disease has not yet progressed into either keratoconus or PMD. The diagnosis of conditions that could lead to significant ectasia after LASIK surgery has been identified by the National Eye institute as a priority area. Since 2010, Prof. Iyer and his team have been working on:\n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Chanaka Kahathuduwa, MBBS., Ph.D.",
    "title": "Research Assistant Professor, Department of Human Development and Family Studies, College of Human Sciences",
    "email": "chanaka.kahathuduwa@ttu.edu",
    "phone": "806-834-2451",
    "website": "http://www.depts.ttu.edu/hs/hdfs/kahathuduwa.php",
    "about": "\nMethods:\nResearch Areas:",
    "institution": "Texas Tech University"
  },
  {
    "name": "Min H. Kang, PharmD",
    "title": "Distinguished University Professor, Associate Vice President for Research Pediatrics, School of Medicine",
    "email": "min.kang@ttuhsc.edu",
    "phone": "806-743-2694",
    "website": "",
    "about": "\nThe focus of Kang Lab's research is in clinical and molecular pharmacology and the conduct of early-phase preclinical studies as well as clinical trials. I am the director of a pharmacology resource laboratory that supports the Children's Oncology Group (COG), the South Plains Oncology Consortium (www.SPONC.org), and the New Approaches to Neuroblastoma Therapy consortium (www.NANT.org). My laboratory conducts preclinical and clinical studies that provide pharmacokinetic, pharmacodynamic, and pharmacogenomic data in support of multiple phase I, II, and III clinical trials within these consortia. I have been working in the area of translational research for decades, and preclinical data from my laboratory have resulted in multiple clinical trials. I have extensive experience in formalized preclinical drug testing, having directed the NCI Pediatric Preclinical Testing Program in vitro testing laboratory (www.PPTPinvitro.org) for 8 years. Particularly germane to the current proposal, my research has been focused on translation research in pediatric cancers in identifying new drugs and the mechanisms of resistance. 1. We have established systemic models of lymphoid malignancies to show that ABT-737 synergized with the current leukemia backbone regimen of acute lymphoblastic leukemia and MCL-1 modulation is the key to overcoming resistance to ABT-737. 2. In addition, we proposed PI3K/mTOR pathway as a key player in dexamethasone resistance in lymphoid malignancies. Our data demonstrated that BEZ235 in combination with dexamethasone was synergistically active in both in vitro and in vivo models of pediatric ALL, and BIM may be a potential biomarker for the combination activity. 3. In our study of MM-398 (nal-IRI), a nanoliposomal irinotecan which is recently approved for colon cancer, we showed that Ewing's family of sarcoma is most susceptible to the drug relative to rhabdomyosarcoma or neuroblastoma, and that SLFN11 was inversely correlated with the activity of the drug.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Martina I. Klein, Ph.D.",
    "title": "Associate Professor, Human Factors Psychology, Department of Psychological Sciences",
    "email": "martina.i.klein@ttu.edu",
    "phone": "806-834-4745",
    "website": "",
    "about": "\nMy research has focuses on the acquisition of laparoscopic and robotic surgery skills and on surgeons' stress and workload (attentional demand) experiences. Towards that end, I have conducted task-analytic studies to identify novice traps (mistakes trainees are likely to make) in the laparoscopic surgery environment. Further, as the laparoscopic surgery environment poses a disruption of hand-eye mapping which is caused by having to view the target tissue indirectly on a monitor via a camera, I assessed whether basic perceptual-motor adaptation research generalizes to the laparoscopic environment. Such understanding is relevant for laparoscopic training. As the laparoscopic environment is known to induce high attentional demands on surgeons and surgical training takes place on patients, it is important to determine when trainees are too overwhelmed. I am the PI on an AHRQ funded research grant to validate a real-time indicator of operators' attentional load and attentional resource depletion in the laparoscopic training environment. While my research so far has focused on surgery, I am very interested in extending my current research to other medical areas, including but not limited to anesthesiology and radiology. Thus, I am looking for collaborators who are supervising the training of medical skills in general.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Amy Koerber, Ph.D.",
    "title": "Professor & Associate Dean for Faculty Success & Inclusion, Communication Studies",
    "email": "amy.koerber@ttu.edu",
    "phone": "806-834-8241",
    "website": "http://amykoerber.academia.edu/",
    "about": "\nDr. Koerber's research agenda centers around the question of how experts make effective arguments, particularly in the context of health, science, and medicine. Toward this end, she employs multiple research methods, including textual analysis as well as interviews and focus groups. Although her doctoral training is based in classical rhetoric, her current research employs a wide variety of theoretical frameworks, and she is especially interested in scholarly approaches that facilitate interdisciplinary collaboration and knowledge-making. Dr. Koerber's current research seeks to understand the role of effective communication in the STEM professions. Specifically, she has conducted a series of interviews with STEM professionals from various disciplines in attempt to understand which communication skills these professionals believe to be most crucial to obtaining and succeeding in leadership positions in their disciplines. Prior to this current project, Dr. Koerber published numerous peer-reviewed articles and two academic books, all related to her broadly defined interests in health and science communication. Her most recent book, \"From Hysteria to Hormones: A Rhetorical History,\" was published by Penn State University Press in April 2018. Her previous book, \"Breast or Bottle: Contemporary Controversies in Infant-Feeding Policy and Practice,\" was published by University of South Carolina Press in 2013, and was awarded the NCTE Award for Best Book in Scientific or Technical Communication. In addition to scholarly publishing, Dr. Koerber has also been involved in multiple collaborative grant-seeking efforts and is always looking for additional opportunities to bring her expertise and experience as a qualitative communication researcher to partnerships with colleagues across the disciplines. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Carla M. R. Lacerda, Ph.D.",
    "title": "Assistant Professor, Department of Chemical Engineering",
    "email": "carla.lacerda@ttu.edu",
    "phone": "806-834-4089",
    "website": "http://www.depts.ttu.edu/che/groups/lacerdagroup/",
    "about": "\nOur work focuses on the development of cell and organ culture models of tissue degeneration. We are interested in understanding the effects of different mechanical stimuli on heart valve degeneration. Once cell mechanoreceptors and associated signaling pathways are known, it will be easier to apply new drugs to slow or reverse disease progression and to improve the design of tissue-engineered valves. In addition to heart valve mechanobiology, our research program also develops new techniques for tissue engineering based on innovative scaffold recellularization approaches. Other projects include: serotonin signals in fibrotic diseases, active cellularization of biological scaffolds, and scaffold patterning. Collaborative projects include organs-on-chips, linking in silico and in vitro characterization of tricuspid valve, combined flexure and shear stimulation of endothelial cells, valvular cell mechanics and characterization of muscle pathobiology in C. elegans.",
    "institution": "Texas Tech University"
  },
  {
    "name": "J. Josh Lawrence, Ph.D.",
    "title": "Associate Professor, Pharmacology and Neuroscience",
    "email": "john.lawrence@ttuhsc.edu",
    "phone": "806-743-3887",
    "website": "",
    "about": "\nThe overall aim of Dr. Josh Lawrence's translational research program is to understand how neuromodulation of specific GABAergic interneuron populations alter circuit function in both normal and pathological states. Dr. Lawrence has investigated how extrinsic input from cholinergic and GABAergic neurons in medial septum-diagonal band of Broca impacts the excitability of interneuron subtypes in the hippocampus. The long term goals of his research are:",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Wei Li, Ph.D.",
    "title": "Assistant Professor, Department of Chemical Engineering",
    "email": "wei.li@ttu.edu",
    "phone": "806-834-2209",
    "website": "http://www.depts.ttu.edu/che/groups/ligroup/index.htm",
    "about": "\nThe Li research group at Texas Tech are focusing on combining cutting-edge microfluidics, soft materials and high throughput nano-assembly techniques to develop novel functional polymer surfaces and devices for biomedical and energy applications. Our expertise include: \nWe have the following unique experimental instrument in the lab:\nWe are looking for potential collaboration in: ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Donald Y.C. Lie, Ph.D., Fellow, IEEE",
    "title": "Keh-Shew Lu Regents Chair Professor, Department of Electrical and Computer Engineering; Chair Professor, Edward E. Whitacre Jr. College of Engineering; National Chiao-Tung University (NCTU), Hsin-Chu, Taiwan, Adjunct Professor, Department of Surgery",
    "email": "Donald.Lie@ttu.edu",
    "phone": "806-834-2440",
    "website": "http://www.tturfsoc.com/",
    "about": "\nDonald Y. C. Lie is currently the Keh-Shew Lu Regents Chair Professor in the Department of Electrical and Computer Engineering, Texas Tech University, Lubbock, Texas, and also an Adjunct Professor in the Department of Surgery, Texas Tech University Health Sciences Center (TTUHSC), supervising M.D./Ph.D students. His research interests are:\nMore information on Dr. Lie's research group can be found HERE.",
    "institution": "Texas Tech University/Texas Tech University Health Sciences Center"
  },
  {
    "name": "Ting Lin, Ph.D.",
    "title": "Assistant Professor, Structural Engineering,Department of Civil, Environmental, and Construction Engineering",
    "email": "ting.lin@ttu.edu",
    "phone": "806-834-5327",
    "website": "http://www.depts.ttu.edu/ceweb/faculty/ting_lin/index.php",
    "about": "\nTing Lin directs the Multi-Hazard Sustainability Research Group (HazSus.org) with parallel tracks in Earthquake Engineering and Climate Change. Interfacing engineering with earth science facilitated by high performance computing and artificial intelligence, her research focuses on earthquake and sea-level rise hazards, risk and uncertainty. Her recent projects include ground motion simulation validation of tall buildings, probabilistic sea-level rise hazard analysis, and virtual reality of earthquake shaking. Passionate about improving infrastructure resilience against multiple hazards, she is thrilled to learn from colleagues at the National Wind Institute (NWI) and the Climate Science Center (CSC), across disciplines at Texas Tech University (TTU) and Texas Tech University Health Sciences Center (TTUHSC). Lin has served on delegation/working group/committees under COP15, NEHRP, SCEC, NIST, ASCE, & NASEM, and as a reviewer for journals, conferences, & funding agencies. Her work has been implemented in hazard mapping, modeling software, and building codes & guidelines. Lin completed her Ph.D. and M.S. in Structural Engineering from Stanford, and B.S. (Hons.) in Civil Engineering and a concentration in Architecture from Cornell. Future collaborations with TTUHSC could potentially address health challenges related to natural and man-made hazards to advance community resilience, perhaps involving multi-national multi-institutional research teams.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Carol S. Lindquist, Ph.D.",
    "title": "Assistant Professor, Department of Sociology, Anthropology & Social Work",
    "email": "carol.lindquist@ttu.edu",
    "phone": "806-834-6162",
    "website": "",
    "about": "\nResearch interests in food consumption & production, health, vernacular architecture, aging, gender, and sexuality. Skills in human-subjects research (qualitative & survey), program evaluation, legislative/regulatory consequences, community impact studies. Experienced with inter/multi-disciplinary studies.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Marc Lochbaum, Ph.D.",
    "title": "Professor, Department of Kinesiology and Sport Management",
    "email": "marc.lochbaum@ttu.edu",
    "phone": "806-834-0882",
    "website": "Websites:",
    "about": "I am Professor of Sport and Exercise Psychology at Texas Tech University in the Department of Kinesiology and Sport Management located in Lubbock, Texas. I have funded projects in many parts of the world. In Lubbock, I am a co-investigator on the East Lubbock Promised Neighborhood grant. I have published in sports psychology journals since 1993. My research interest is motivational theories in physical activity and competitive sports settings. I am a recognized international expert in achievement goal theory. My East Lubbock Promised Neighborhood work is the most logical area for TTU/TTUHSC collaboration. I see about 200 children a day in my afterschool programs (grades K-5). Projects concerning heath, education, and physical activity are welcomed.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Angela Lumpkin, Ph.D.",
    "title": "Professor & Department Chair, Department of Kinesiology & Sport Management",
    "email": "angela.lumpkin@ttu.edu",
    "phone": "806-834-6935",
    "website": "http://www.depts.ttu.edu/ksm/contact/pages/alumpkin.php",
    "about": "\nAngela is the author of 25 books and 12 book chapters. She has published over 75 refereed manuscripts and delivered 25 invited lectures and over 180 professional conference presentations. She has received over $3 million in external grants. She conducts research and publishes in the areas of sport ethics, leadership, intercollegiate athletics, women in sport, and teaching effectiveness. She was the 2008-2009 Gene A. Budig Teaching Professor in the School of Education at the University of Kansas and named to the Texas Tech University Teaching Academy for excellence in teaching and contributions to teaching in 2016. She received the North American Society for Sport Management's Distinguished Educator Award in 2018.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Conrad P. Lyford, Ph.D.Dr. Lyford",
    "title": "Professor, Deptartment of Agricultural and Applied Economics",
    "email": "conrad.lyford@ttu.edu",
    "phone": "806-834-2132",
    "website": "Websites:",
    "about": "Conrad Lyford, Ph.D., Professor, Agricultural and Applied Economics, is interested in participating in projects with strong impact potential addressing behavior and health outcomes in the health and food sectors. In particular, he is interested in applying behavioral economic principles to interventions that result in high impact with low cost. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Brendan MacKay, M.D.",
    "title": "Assistant Professor, Department of Orthopedic Surgery and Rehabilitation",
    "email": "brendan.j.mackay@ttuhsc.edu",
    "phone": "806-743-2465",
    "website": "",
    "about": "\nDr. Brendan MacKay is an Assistant Professor, Department of Orthopaedic Surgery - Hand Division at TTUHSC. He secured participation for Texas Tech University Health Sciences Center as a research site in RANGER (Registry of Advance Nerve Graft Evaluating Utilization and Outcomes for the Reconstruction of peripheral Nerve Discontinuities). Additionally, Dr. MacKay and Dr. Desiree McKee have secured participation for Texas Tech University Health Sciences Center as a research site for AVIVE® Soft Tissue Membrane by AxoGen. Avive® Soft Tissue Membrane is a minimally processed human umbilical cord membrane that can be used as a resorbable soft tissue covering to separate tissue layers. Dr. MacKay is an active surgeon and conducts research in the following areas:",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Jeremy Marston, Ph.D.",
    "title": "Assistant Professor, Department of Chemical Engineering",
    "email": "jeremy.marston@ttu.edu",
    "phone": "806-834-7012",
    "website": "http://marstonlab.wixsite.com/fluids",
    "about": "\nCurrent vaccination practice is dominated by delivery via hypodermic needle and syringe (HNS), which are undesirable due to sharps waste and needle-stick injuries, but also unsuitable for delivery of some products, especially those with high-viscosity (µ ≥ 100 mPa.s) such as novel DNA-based vaccines, which could revolutionize the fight against infectious diseases. In fact, pipeline vaccines for Zika, Ebola, HIV, HPV, and certain cancers are already in existence, but await a reliable delivery method due to high viscosity and the narrow target region (e.g. intradermal). One candidate is jet injection, however, since the physical mechanisms in jet injection are still not fully understood, it is unclear whether current jet injector designs are optimized for a range of fluid viscosities. In particular, the role of the underlying tissue stiffness in jet injection is unknown and must be studied systematically to guide the choice of injection site. We are currently working on a broad comparison between needle and jet injections, using in-vitro, ex-vivo and cadaver studies. We are seeking collaborators for the cadaver studies.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Timothy Matis, Ph.D., PE",
    "title": "Associate Professor, Department of Industrial, Manufacturing, and Systems Engineering; Associate Director of the Center for High Reliability Organizations and Processes (CEHROP)",
    "email": "timothy.matis@ttu.edu",
    "phone": "806-834-8589",
    "website": "",
    "about": "\nMy research is in the domain of healthcare systems engineering, looking at the optimal delivery of care and patient safety. This includes topics related to patient flow, patient scheduling, and inventory management, and to the management of patient safety in complex systems. My recent work looks at implementation strategies and the effectiveness of high reliability organizational theory in healthcare settings.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Desirae McKee, M.D.",
    "title": "Associate Professor, Department of Orthopaedic Surgery and Rehabilitation",
    "email": "desirae.mckee@ttuhsc.edu",
    "phone": "806-743-2465",
    "website": "",
    "about": "\nDr. Desirae McKee is an Associate Professor, Department of Orthopaedic Surgery - Hand Division at TTUHSC. She is also a Shannon Holloway Chair. She is a co-investigator at the TTUHSC research site for RANGER (Registry of Advance Nerve Graft Evaluating Utilization and Outcomes for the Reconstruction of peripheral Nerve Discontinuities). Additionally, Dr. McKee and Dr. Brendan MacKay have secured participation for Texas Tech University Health Sciences Center as a research site for AVIVE® Soft Tissue Membrane by AxoGen. Avive® Soft Tissue Membrane is a minimally processed human umbilical cord membrane that can be used as a resorbable soft tissue covering to separate tissue layers. Dr. McKee is an active surgeon and conducts research in the following areas:",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Keino McWhinney, MPP",
    "title": "Director, Texas Tech Mental Health Institute",
    "email": "keino.mcwhinney@ttuhsc.edu",
    "phone": "806-743-2245",
    "website": "",
    "about": "\nThe Texas Tech Mental Health Institute seeks to leverage innovative activities in education, research, and service across the Texas Tech University System (TTUS) and in collaboration with community stakeholders in support of a comprehensive approach to achieve optimal mental health outcomes for those served by the university system. Building on the existing strengths of the TTUS component institutions, TTMHI will develop a \"Texas Tech Model\" as an integrated approach for early intervention and the delivery of mental health services and explore opportunities for collaborative research. This model will bring together an interdisciplinary team of physicians, psychologists, marriage and family therapists, counselors, social workers, researchers, and peer specialists to deliver whole person care and include the strategic engagement of caregivers who support individuals with mental health and substance use disorders. In seeking to act across the continuum of care, TTMHI will implement the use of evidence-based programs for increasing community capacity to address mental health problems.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Yehia Mechref, Ph.D.",
    "title": "Paul W. Horn Professor, Department of Chemistry and Biochemistry, Department Chairman, Department of Chemistry and Biochemistry, Director, TTU Center for Biotechnology & Genomics",
    "email": "yehia.mechref@ttu.edu",
    "phone": "806-834-8246",
    "website": "",
    "about": "\nDr. Yehia Mechref (Paul W Horn Professor, Chairperson Department of Chemistry and Biochemistry, Director of the Center for Biotechnology and Genomics) is a world-renowned biomolecular mass spectrometry scientist. The research of Dr. Mechref's group is focused on developing biomolecular mass spectrometry methods that enable the detection of biomolecules at high sensitivity. He is a world leader in MS-based glycomics, glycoproteomics, metabolomics and proteomics. His glycomics and glycoproteomics MS-based methods are routinely used to better understand the role of glycans in the development and progression of many human diseases including cancer, HIV, Traumatic brain injury (TBI) and Multiple sclerosis (MS). Dr. Mechref's research is funded by NIH and CPRIT.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Naïma Moustaid-Moussa, Ph.D., FTOS, FAHA",
    "title": "Professor, Department of Nutritional Sciences, Director, Obesity Research Cluster",
    "email": "naima.moustaid-moussa@ttu.edu",
    "phone": "806-834-7946",
    "website": "Websites:",
    "about": "Potential For Collaborations:\nMoustaid-Moussa has been leading a funded basic and integrated nutrition and obesity research, with emphasis on the endocrine function of adipose tissue and nutrient-gene interactions in metabolic diseases. Her current research includes mechanisms by which:\nHer secondary areas of interest include beta cell function in diabetes and childhood obesity prevention.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Mary Murimi, Ph.D.",
    "title": "Professor, Department of Nutritional Sciences",
    "email": "mary.murimi@ttu.edu",
    "phone": "806-834-1812",
    "website": "http://www.depts.ttu.edu/hs/ns/murimi.php",
    "about": "\nMy research interests include understanding the effects of the community environment on the nutrition status of the residents, and identifying coping strategies for food insecurity and factors that influence dietary behavior, especially among low-income populations. I have conducted community-wide outreach projects aimed at behavior modification in the prevention of obesity and the related chronic diseases among rural residents. I apply the ecological approach and train the trainer model when conducting community based participatory research. At the international level, I have collaborative relationship with institutions in Ethiopia, Vietnam and Kenya. In Ethiopia, I have a USAID funded project on linking livestock to human nutrition. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Srinivas Nandana, Ph.D.",
    "title": "Assistant Professor, Department of Cell Biology & Biochemistry",
    "email": "Srinivas.Nandana@ttuhsc.edu",
    "phone": "806-743-4101",
    "website": "",
    "about": "\nThe 5-year survival of primary prostate cancer is nearly 100%, however, alarmingly the survival rate decreases to 29% in metastatic disease. Prostate cancer metastasizes predominantly to the bone, but currently there is no effective therapy against prostate cancer bone metastasis although it is the predominant cause of morbidity and mortality in the clinic. It is therefore of pivotal importance to identify the molecular mechanisms by which primary prostate cancer cells metastasize to bone. A major hurdle in our understanding of this process is the lack of an animal model that spontaneously recapitulates all the steps of this process in an in vivo experimental model with an intact immune system. To address this major limitation, we have developed a syngeneic mouse model that develops a high frequency of bone metastasis in immune competent hosts. This approach provides us with a novel tool to investigate cancer homing and interaction with the bone in an immune-competent host microenvironment more closely mimicking human physiology. In my laboratory, using a variety of pre-clinical mouse models – xenograft, syngeneic, and transgenic mice - we investigate the molecular and signaling mechanisms that mediate prostate cancer progression including homing and growth of prostate cancer cells in the bone. I am interested in collaborating with other laboratories towards investigating immune-based therapeutic strategies against prostate cancer bone metastasis. In summary, our research endeavors are focused on studying the biology, signaling network, and tumor-microenvironment interactions involved in the manifestation of bone metastasis during prostate cancer lethal progression, with the goal of developing novel therapeutics against the disease. In addition to my interests in prostate cancer, I also have a broad interest in collaborating with other laboratories to investigate tumor-microenvironment interactions and host immune surveillance functions in other tumor models to uncover molecular insights into a broad spectrum of solid tumors.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Volker Neugebauer, M.D, Ph.D.",
    "title": "Professor and Chair, Department of Pharmacology and Neuroscience; Giles McCrary Endowed Chair; Addiction Medicine",
    "email": "volker.neugebauer@ttuhsc.edu",
    "phone": "806-743-3880",
    "website": "https://www.ttuhsc.edu/medicine/pharmacology",
    "about": "The focus of Dr. Neugebauer's research over the past two decades has been on synaptic and cellular mechanisms of higher brain functions and dysfunctions in pain conditions and neuropsychiatric disorders. Dr. Neugebauer pioneered the field of pain-related neuroplasticity in the amygdala, a brain center for emotions. The analysis of emotional-affective and cognitive brain mechanisms of pain centered on the amygdala and cortico-limbic interactions is a key contribution of his work to the field of pain research and neuroscience. Through collaborative research projects his team explores brain mechanisms of chronic pain, alcohol abuse and addiction disorders, comorbidities with depression and anxiety disorders, neurodegenerative disorders, and epileptogenesis. Dr. Neugebauer's research program uses a multidisciplinary approach that integrates innovative technologies (state-of-the-art systems and slice electrophysiology, multi-photon imaging in vivo and ex vivo, microendoscopy for live imaging, optogenetics, viral vector strategies, pharmacology and innovative behavioral assays). Dr. Neugebauer's research has been continuously funded by NIH since 1999. Collaborations with TTU could be driven by approaches (transcriptomics, HPLC) or concepts (exploring novel targets, interventions, materials, models).",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Bryan A. Norman, Ph.D.",
    "title": "Professor & Department Chair, Department of Industrial, Manufacturing, and Systems Engineering",
    "email": "bryan.norman@ttu.edu",
    "phone": "806-742-3543",
    "website": "www.depts.ttu.edu/ieweb",
    "about": "\nPotential For Collaborations: I am interested in collaborating on projects related to healthcare delivery. I conduct analysis of healthcare systems and seek to optimize their performance. Bryan A. Norman is Professor and Chair of the Department of Industrialxfrt, Manufacturing, and Systems Engineering at Texas Tech University. Dr. Norman has over twenty years of experience in process and operations improvement and optimizing the performance of logistics systems including process flow, facility layout, scheduling, inventory management, and supply chain design. He has applied his work in manufacturing, retail, service and healthcare settings. During the last ten years he has focused primarily on healthcare applications. Dr. Norman's research in healthcare delivery spans three primary domains: supply chain design and operation, staffing and scheduling, and coordinating and improving process flow. He is the author of over 60 journal publications and has presented more than 100 seminars, invited lectures, and conference presentations. He has been funded by the National Science Foundation, the National Institutes of Health, the Veteran's Administration, the Gates Foundation, the University of Pittsburgh Medical Center and other industry partners. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Michael W. O'Boyle, Ph.D., FPsyS.",
    "title": "Associate Dean for Research, College of Human Sciences",
    "email": "michael.oboyle@ttu.edu",
    "phone": "806-834-8590",
    "website": "",
    "about": "Dr. Michael W. O'Boyle, Ph.D., FPsyS.is the Associate Dean for Research, College of Human Sciences and Professor in the Department of Human Development and Family Studies. He is also an Adjunct Professor of Pharmacology and Neuroscience in the School of Medicine, Texas Tech University Health Sciences Center. His work focuses on individual differences in cognition and brain function, using fMRI techniques to investigate the neurological origins and mechanisms of intellectual giftedness, musical ability, creativity and/or cognitive disabilities (e.g., ADHD, autism, etc.)",
    "institution": "Texas Tech University/Texas Tech University Health Sciences Center"
  },
  {
    "name": "Bolanle A. Olaniran, Ph.D.",
    "title": "Professor & Interim Chairperson, Communication Studies",
    "email": "B.Olaniran@ttu.edu",
    "phone": "806-834-3978",
    "website": "",
    "about": "\nMy research includes Computer-Mediated Communication, Organization communication, Cross-cultural communication, and Crisis Management and Communication. The interest in Computer-Mediated Communication has led me to explore the impact of communication technologies in organizations, Health communication, and interpersonal settings such as E-Learning, Knowledge management, decision making, and even gaming but more broadly Human-Computer Interaction (HCI) and Virtual Reality. As for Cross-cultural communication, my work has been influenced by Geert Hofstede's dimensions of cultural variability which has led me to explore implications of technology design in global settings. With Crisis management my focus is on crisis prevention and management. This focus has allowed me to look at the impact of issues management in crisis and very recently the move towards development of Crisis communication center as a key resource in crisis preparedness and management. Furthermore, crisis management has prompted me to explore health communication and especially risk message design and communication. I am looking to continue collaboration with people in STEM Core disciplines.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Jorgelina Orfila, Ph.D.",
    "title": "Associate Professor, School of Art",
    "email": "Jorgelina.orfila@ttu.edu",
    "phone": "806 834-0038",
    "website": "Animationduo.com",
    "about": "\nDr. Jorgelina Orfila joined the Art History faculty in Fall 2008. Originally from Argentina, her Ph.D. is from the University of Maryland, College Park. Her dissertation Paul Cézanne and the Making of Modern Art History explores the historiography of art history and museography in the interwar period. She has curated numerous exhibitions and published several articles in her areas of special interest: Modernism and the history of art history, Paul Cézanne, John Rewald, museography in the Interwar Period, and the use of photographs for the study of modern art. She is at present working with Dr. Francisco Ortega-Grimaldo on a research and teaching interdisciplinary project that examines the intersections of animation and the fine arts.\nIn February 2019, they created an Animation Studies chapter at the Southwest Popular/American Culture Association Conference (SWPACA). They are also collaborating with the Burkhart Center for Autism Education & Research by developing animation workshops. This is an initial step for the establishment of a branch of HEART (Healing Education Animation Research Therapy) in the US: HEART Texas. HEART is an award-winning provision that was founded in the North East of England but has expanded to the East Midlands. HEART's scholars and practitioners explore the benefits of using the animation process in therapeutic and educational contexts. HEART Texas will be the first HEART center outside the U.K.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Francisco Ortega-Grimaldo, Ph.D.",
    "title": "Associate Professor, School of Art",
    "email": "francisco.ortega@ttu.edu",
    "phone": "806 834 5785",
    "website": "Animationduo.com",
    "about": "\nFrancisco is an Associate Professor in Graphic Design and Coordinator of the PhD Fine Arts program at the School of Art, Texas Tech University (TTU). He earned his undergraduate degrees and MA at the University of Texas, El Paso, and his PhD in Critical Studies and Artistic Practice at TTU (2008). A practicing artist and scholar, his interests include: Historical and Critical Perspectives in Animation, Game Design Theory and History, Graphic Design, and Interdisciplinarity in the Arts.\nHe collaborates with Dr. Jorgelina Orfila in a research project that explores the interactions between animation and contemporary art. They are also collaborating with the Burkhart Center for Autism Education & Research by developing animation workshops as an initial step for the establishment of a branch of HEART (Healing Education Animation Research Therapy) in the US: HEART Texas. He also collaborates with Dr. Sue Ann Lee in a project that uses animation to teach new words to children with language disabilities (\"The Effect of Animation in Learning Novel Words in Children with Specific Language Impairment\"). \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Komaraiah (Kumar) Palle, Ph.D.",
    "title": "Associate Professor, Department of Cell Biology & Biochemistry; Kayla Weitlauf Endowed Chair for Women's Health",
    "email": "komaraiah.palle@ttuhsc.edu",
    "phone": "806-743-2990",
    "website": "",
    "about": "\nThe overarching goals of our research efforts are to elucidate molecular mechanisms of carcinogenesis processes and contribute significantly to prevention and treatment of different malignancies by basic and translational research. Thus, the focus is two dimensional: The basic science research projects focused on understanding the complex interplay between tumor suppressors and oncogenes in genome maintenance, and mutations or their deregulation in carcinogenesis and tumor development. Primarily, DNA damage response and repair signaling genes are tumor suppressors that constantly protect chromosomal DNA from environmental and metabolically generated genotoxins and from oncogenic replication stress. Mutations in these genes manifest into genome instability syndromes such as Fanconi anemia (FA) and Breast and Ovarian Cancer early onset (BRCA). In contrast, tumor cells also acquire resistance to chemo and radiation therapy by altered regulation of cell cycle checkpoints (ATM, ATR) and DNA repair networks. These mechanisms and their regulation are highly complex, and often they are differentially regulated in tumor cells, particularly in the context of oncogenic or growth factor signals they adopt.\nThe translational research projects focused on genetic and epigenetic mechanisms that tumor cells adopt to survive from oncogenic replication stress and from chemo and radiation therapy. My lab is particularly interested in understanding how activated oncogenic signals (growth factor receptors, signaling proteins such as Hedgehog/GLI, RAS, inflammatory and epigenetic regulators) influence tumor suppressors and cell cycle checkpoint signaling cascades. Our goal is to identify key regulators of these complex networks in tumors cells and develop rotationally designed therapeutic combinations to effectively kill tumor cells, which are also known as proof-of-concept based and synthetic lethality approaches. Areas of my translational interest are primarily Ovarian and Breast cancers, and extended to other malignancies.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Oak-Hee Park, Ph.D., RD",
    "title": "Research Assistant Professor, Human Sciences",
    "email": "oak-hee.park@ttu.edu",
    "phone": "806-834-0291",
    "website": "",
    "about": "Oak-Hee Park has been conducting various research projects related to nutrition, food, health, and consumer behavior. Her current research areas are focusing on Nutrition Education, Food Environment, Public Health, Obesity Prevention, and Sustainable Food System. Since 2013, she has worked on the East Lubbock Promise Neighborhood (ELPN) Grant funded by the U.S. Department of Education. As Co-PI, she established the first community-based family cooking program for underserved populations. She also conducts a food environment study in the Lubbock area using the NEMS-S and NEMS-R surveys, and has actively led an obesity prevention project for early adolescents at Talkington School for Young Women Leaders to promote individual's self-efficacy about healthy cooking that may encourage adolescents to reduce risky eating behavior, leveraging body acceptance and mindful eating practices for the prevention of obesity.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Debajyotie Pati, Ph.D., FIIA, IDEC, LEED AP",
    "title": "Professor and Rockwell Endowment Chair, Department of Design; Director, North American Chapter, International Academy for Design and Health",
    "email": "d.pati@ttu.edu",
    "phone": "806-834-0850",
    "website": "http://www.myweb.ttu.edu/dpati",
    "about": "Over the past two decades my research has focused on examining the influence of physical design on patient/staff/organizational outcomes in healthcare facilities. These include issues pertaining to, among others, safety, efficiencies, and care quality. I just concluded a NIH sponsored study on patient falls in hospitals and awaiting decision on a NIH grant application for the next phase of the patient fall study. As a healthcare design architect, I have worked on projects at over 70 hospitals and healthcare systems, world-wide, and served as Vice President at HKS Architects, an international healthcare design firm, before moving to TTU.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Gad Perry, Ph.D.",
    "title": "Assistant Professor, Department of Natural Resource Management; Senior Director, Division of International Research and Development; Director, International Center for Arid and Semiarid Land Studies",
    "email": "gad.perry@ttu.edu",
    "phone": "806-834-2339",
    "website": "http://www.iaff.ttu.edu/home/icasals/index.asp",
    "about": "I am an ecologist in the broadest sense, with a strong focus on conservation. Specific projects have leaned towards behavioral ecology, evolutionary ecology, historical ecology, invasive species, physiological ecology, urban ecology, and policy.\nHowever, my participation is mostly in my context as Senior Director of the TTU International Research and Development Division, which expands international ties with academic institutions. We are seeing a lot of RFPs that include health components and believe that greater collaboration with TTUHSC will make for more compelling and fundable proposals.\nI am an ecologist in the broadest sense, with a strong focus on conservation. Specific projects have leaned towards behavioral ecology, evolutionary ecology, historical ecology, invasive species, physiological ecology, urban ecology, and policy.\nHowever, my participation is mostly in my context as Senior Director of the TTU International Research and Development Division, which expands international ties with academic institutions. We are seeing a lot of RFPs that include health components and believe that greater collaboration with TTUHSC will make for more compelling and fundable proposals.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Beau S. Pihlaja, Ph.D.",
    "title": "Assistant Professor, Technical Communication and Rhetoric, Department of English",
    "email": "beau.pihlaja@ttu.edu",
    "phone": "915-838-5126",
    "website": "www.beaupihlaja.com",
    "about": "\nI am an assistant professor in Technical Communication and Rhetoric with the Department of English at Texas Tech University. My previous research explored the mediating effects of communication technologies (e.g., WhatsApp) on intercultural encounters in a bi-national company situated on the U.S.-Mexico border. I am interested in health communication in intercultural contexts, the rhetoric of mental health (specifically autism and ADHD), technologically-mediated rhetoric, technical communication, and cultural usability. I am looking to develop and contribute to projects that involve (or could involve) doctor-patient communication about mental health issues in intercultural contexts, document design accessibility for neuroatypical readers, as well as redesigning digital texts, and digital learning environments for neuroatypical individuals in mono- or multicultural environments.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Deidre Popovich, Ph.D.",
    "title": "Assistant Professor, Rawls College of Business",
    "email": "deidre.popovich@ttu.edu",
    "phone": "806-834-2984",
    "website": "www.deidrepopovich.com",
    "about": "\nDeidre Popovich is an Assistant Professor of Marketing in the Rawls College of Business at Texas Tech University. She has a Ph.D. in Business from Emory University and an MBA from Vanderbilt University. Her research focuses on consumer psychology, including how decision contexts and information cues can influence healthful consumer decision-making and increased self-control. Her previous industry experience includes working as a marketing research manager for a national nonprofit organization and as a strategy consultant for a top-ten healthcare consulting firm.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Paola Prada, Ph.D.",
    "title": "Research Assistant Professor, Graduate Program Director Forensic Science Master's Program, Department of Environmental Toxicology",
    "email": "paola.prada@ttu.edu",
    "phone": "806-834-0983",
    "website": "http://www.entx.ttu.edu/dr.-paola-a.-prada.html",
    "about": "\nDr. Paola Prada is the Graduate Program Director for the Forensic Science Master's Program in the Department of Environmental Toxicology. Her research efforts are centered in the main scope of \"volatolomics\", specifically in the analysis of volatile organic compounds from biological as well as other forensic specimens which could yield a chemical odor profile useful for discriminatory and identification purposes. To achieve these objectives, the analytical methods implemented in our laboratory include the use of instrumentation such as gas chromatography/mass spectrometry and solid phase microextraction that allow the efficient extraction and detection of target analytes with minor sample disturbance. A particular interest is in understanding the complex odor picture available to the canine nose in the many military and law enforcement applications of working dog canine teams. Current forensic research areas targeted in the Prada laboratory include: human odor traces, chronic wound pathogens, explosive odor residues, and decomposition odor analysis in matrices such as blood, larval masses (maggots) and tissue for postmortem interval estimation purposes. Her research has explored the role of volatile odor profiles in collaboration with colleagues working in a variety of disciplines, including, law enforcement, chemistry, health sciences, and animal science.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Narissra Maria Punyanunt-Carter, Ph.D.",
    "title": "Associate Professor, Assistant Dean for International Affairs, College of Media & Communication",
    "email": "n.punyanunt@ttu.edu",
    "phone": "806-742-3385",
    "website": "",
    "about": "\nMy research focuses on interpersonal communication and satisfaction. I'm interested in the ways in which we communicate with others in order to be effective and satisfying. My research interests include social media effects and influences. I am particularly interested in the ways people perceive those messages to be appropriate and effective. I'm looking forward to building partnerships with those interested in discovering ways to make communication better for the patient-provider relationship and/or in health-related areas.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Wm. Trey Putnam, Ph.D., RAC",
    "title": "Professor, Department of Pharmaceutical Sciences; Professor, Department of Pharmacy Practice; Director, Clinical Pharmacology and Experimental Therapeutics Center",
    "email": "trey.putnam@ttuhsc.edu",
    "phone": "214-358-9018",
    "website": "",
    "about": "\nI have a personal passion for and have a broad background in drug discovery, drug development and regulatory affairs. I have specific deep experience in organic, analytical and bioanalytical chemistry. My chemistry background is complimented by my experience and expertise in clinical pharmacology and metabolism. My research includes the following specific aims:\nI have served as PI or co-investigator on several university-, DOD-, NIH-, and private industry-funded grants across these areas. Additionally, I have broad interest in the regulatory science behind drug development and regulatory approval. \n ",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Latha Ramalingam, Ph.D.",
    "title": "Research Assistant Professor, Department of Nutritional Sciences",
    "email": "latha.ramalingam@ttu.edu",
    "phone": "806-834-0841",
    "website": "",
    "about": "\nDr. Ramalingam is a Research Assistant Professor in the Department of Nutritional Sciences. Her research interests include strategies, both in vitro and in vivo, to investigate the effects of Bioactives (omega-3 fatty acids) in maternal obesity. She is also interested in studying the role of the Renin Angiotensin System (RAS) in beta cells.",
    "institution": "Texas Tech University"
  },
  {
    "name": "David A Ray, Ph.D.",
    "title": "Associate Professor, Department of Biological Sciences",
    "email": "david.a.ray@ttu.edu",
    "phone": "806-834-1677",
    "website": "davidraylab.com",
    "about": "\nMy expertise is in animal genomics with a focus on transposable elements (TEs), genomic fragments with the ability to mobilize and expand their presence in the genome. One of our primary areas of interest is bat genomics, primarily due to two interesting properties. First, several groups of bats exhibit TE repertoires that are unusual among mammals. Whereas most mammals harbor only 2-3 actively mobilizing TE families, typically of similar types, certain bats exhibit up to 20 mobilizing TE families of all possible types. We believe that this unique characteristic of their genomes may be influencing the second property of interest, exceptional longevity. Generally among mammals, there is a positive correlation between body mass and longevity, i.e. as size increases, so does lifespan. Of the 19 outliers to this pattern, 18 are bats. One species, Myotis myotis, which is characterized by the unique TE repertoire described above, has been known to live 46 years, while your typical laboratory mouse has an average lifespan of ~2 years. This extraordinary longevity is accompanied by few of the signs of senescence that haunt humans as they age. Because TEs have significant impacts on the structure and function of genomes, we see this as an excellent opportunity to collaborate with researchers interested in aging phenotypes as they relate to genome evolution and the evolution of gene regulation.",
    "institution": "Texas Tech University"
  },
  {
    "name": "P. Hemachandra Reddy, Ph.D.",
    "title": "Professor of Internal Medicine, Neuroscience/Pharmacology, Neurology, & Public Health",
    "email": "hemachandra.reddy@ttuhsc.edu",
    "phone": "806-743-2393",
    "website": "",
    "about": "\nP. Hemachandra Reddy, Ph.D., is the Tenured Professor of Internal Medicine, Neuroscience/Pharmacology, Neurology, Public Health and Speech, Language and Hearing Departments at Texas Tech University Health Sciences Center in Lubbock. Dr. Reddy was formerly an Executive Director and Chief Scientific Officer of the Garrison Institute on Aging and former Associate Scientist in the Division of Neuroscience at the Oregon National Primate Research Center, affiliated with Oregon Health & Sciences University. Dr. Reddy received his B.Sc. and M.Sc. in biology from Sri Venkateswara University, Tirupati, India, and he received an M. Phil in human cytogenetics from Delhi University. As a commonwealth scholar (1990–1993), he was awarded his PhD (1994) in human genetics from the University College, London. From 1995 to 2000, Dr. Reddy received postdoctoral training at the National Human Genome Research Institute of the National Institutes of Health. He was a standing member of the Veteran Affairs Merit Review Study Section and served on several NIH study sections. He currently is a standing member of the Neuronal Oxidative Metabolism and Death study section (2013–2019) and is the principal investigator to 2 NIH R01 grants and to 1 NIH STTR grant. Dr. Reddy's research interests are – Drug Discovery, Aging, Neurodegenerative Diseases including Alzheimer's, Huntington's Parkinson's and Multiple Sclerosis, Biomarker Development and Animal models. Dr. Reddy is an elected fellow of the American Neurological Association, and he is a member of the New York Academy of Sciences. Dr. Reddy is the author or co-author of more than 140 peer-reviewed publications, including publications in such journals as Nature Genetics, Human Molecular Genetics, Trends in Neurosciences, Trends in Molecular Medicine and Drug Discovery Today. He received several awards and honors including Prestigious Bharath Gaurav Award (2016) from Government of India; best mentor award (2003) and Technology innovation award (2007) from Oregon Health and Science University and Alzheimer's Award (2006) from the Journal of Alzheimer's Disease and Fellows Award for Research Excellence (FARE Award) (1999) from National Institutes of Health. Dr. Reddy was honored with a certificate of recognition for his contributions to neurology and brain disorders at the second International conference, Rome, Italy June 3-6, 2018.\nCurrently, Dr. Reddy is collaborating with Dr. Vijay Hegde from Nutritional Sciences, TTU, published several papers (or submitted or in press), actively working on an RO1 proposal for June 2019 submission deadline. He is also collaborating with Dr. Youndeok Kim from Department of Kinesiology and Sports Management of TTU. Dr. Reddy is actively collaborating with School of Pharmacy, Amarillo colleagues Dr. Vardan Karamyan on Ischemic Stroke, published papers and submitted an R21 proposal; Dr Paul Tripper for drug discovery project on Huntington disease and he a part of Dr. Tripper's R21 proposal.\nAt TTUHSC, Lubbock campus, Dr. Reddy is collaborating with Drs. Sanjay Awasthi (Internal Medicine), Marcella Rivas (Internal Medicine) and Hafiz Khan (Public Health) for cancer, diabetes and obesity research projects.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Leigh Ann Reel, Au.D., Ph.D., CCC-A",
    "title": "Associate Professor, Department of Speech, Language, and Hearing Sciences",
    "email": "leigh.reel@ttuhsc.edu",
    "phone": "806-743-9071",
    "website": "",
    "about": "\nDr. Leigh Ann Reel is an associate professor of audiology in the TTUHSC Department of Speech, Language, and Hearing Sciences. Her line of research relates to noise-induced hearing loss and use of hearing protection for children and adults. Dr. Reel's studies have focused on children in rural areas, junior high and high school teachers who teach shop classes that use loud power tools/equipment, and fitness class instructors and participants. Her goal is to identify populations at risk for noise-induced hearing loss and develop educational materials and programs designed to motivate these populations to protect their hearing. She would like to collaborate with individuals with interests that relate to these areas, as well as those with expertise in survey research. As an audiology professor and licensed audiologist, Dr. Reel also has the potential to collaborate with other researchers studying topics where expertise related to hearing or hearing loss is needed.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "C. Patrick Reynolds, M.D., Ph.D.",
    "title": "Director, Cancer Center; Distinguished University Professor of Pediatrics, Internal Medicine, and Cell Biology & Biochemistry, TTUHSC School of Medicine",
    "email": "patrick.reynolds@ttuhsc.edu",
    "phone": "806-743-1558",
    "website": "http://cancer.TTUHSC.edu",
    "about": "\nMy research focuses on cancer developmental therapeutics, both in the laboratory and in phase I, II, and III clinical trials. Expertise includes molecular target discovery, preclinical drug testing (in vitro and in vivo), formulation development, filing of IND's with the FDA, design and conduct of oncology clinical trials. Cancers of particular interest are neuroblastoma, lymphomas, sarcomas, ovarian cancer, and pancreatic cancer. My laboratory is the Children's Oncology Group/ALSF Childhood Cancer Repository (www.COGcell.org) and we establish cell lines and patient-derived xenografts (PDXs) from childhood cancers and distribute them to > 600 laboratories in 25 countries. We also establish cell lines and PDXs from adult cancers for use by ourselves and our collaborators. Laboratory expertise includes STR profiling, analysis of RNA and WES sequencing data, in vitro cytotoxicity testing and testing in xenografts of anti-neoplastic drugs, analysis of cell death pathways especially BCL2, telomerase, and alternate telomere lengthening mechanisms, culture of cancer cells in physiological hypoxia, and quantifying tumor cell surface antigens by flow cytometry.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Eric Rivas, Ph.D.",
    "title": "Assistant Professor of Exercise Physiology, Department of Kinesiology and Sport Management",
    "email": "eric.rivas@ttu.edu",
    "phone": "806-834-8563",
    "website": "https://www.depts.ttu.edu/ksm/contact/pages/erivas.php",
    "about": "My research expertise is in integrative human physiology with a focus on how exercise and thermal stress affect cerebral, cardiovascular, and metabolic health. I have conducted randomized control trials using exercise rehabilitation for improving cardiovascular and metabolism in clinical populations. Current projects involve 1) cerebral blood flow hemodynamics during exercise under exertional heat stress, 2) heat therapy and omega 3s on vascular, metabolic, and microbiome health in Mexican Americans, and 3) exercise and heat stress on improving arterial stiffness, and 4) heat acclimation on cognition, cerebral autoregulation, and brain function. I am looking for collaborations that want to use exercise training or heat \"therapy\" in clinical populations such as aging, depression, obesity, hypertension, and other populations with arthritis and pain. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Parviz Safadel, Ed.D.",
    "title": "Research Assistant Librarian",
    "email": "Parviz.safadel@ttu.edu",
    "phone": "806-834-1276",
    "website": "https://www.depts.ttu.edu/library/IML/",
    "about": "\nI am an instructional designer. My research examines virtual and augmented reality issues in teaching and learning environments with spatial frameworks.\n\nMy projects are diverse: from finding new ways to increase collaboration and integration of the students in learning environments to inventing ways to help students with special needs; to understanding the cognitive process of learning in immersive and non-immersive environments, to name a few.\nI am an instructional designer. My research examines virtual and augmented reality issues in teaching and learning environments with spatial frameworks.\n\nMy projects are diverse: from finding new ways to increase collaboration and integration of the students in learning environments to inventing ways to help students with special needs; to understanding the cognitive process of learning in immersive and non-immersive environments, to name a few.\nI am an instructional designer. My research examines virtual and augmented reality issues in teaching and learning environments with spatial frameworks.\n\nMy projects are diverse: from finding new ways to increase collaboration and integration of the students in learning environments to inventing ways to help students with special needs; to understanding the cognitive process of learning in immersive and non-immersive environments, to name a few.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Rupinder Saini, Ph.D.",
    "title": "Research Assistant Professor (Weed Science), Department of Plant and Soil Science",
    "email": "r.saini@ttu.edu",
    "phone": "806-834-7296",
    "website": "",
    "about": "\nMy research program is focused on the development of integrated strategies for weed management in specialty crops (vegetable, ornamental, turf, and grape production). The limited number of herbicide options as well as carryover concerns complicates the management of weeds in most of these crops. Therefore, my research goal is to improve horticultural crop performance by minimizing the impact of weed populations. I am working on plant-herbicide interactions, strategic use of cultural practices/organic methods and equipment to manage weeds, and potential influences of soil and climatic factors on weed growth and development. Herbicide-resistance is an another concern throughout the world, my research is also focused on assessing herbicide resistant weeds in the semi-arid west Texas region and providing alternative solutions to prevent/manage herbicide resistant weeds.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Ryan N. Schmidt, Ph.D., MBA, MS, CMRP",
    "title": "Chair & Associate Professor, Department of Healthcare Management & Leadership",
    "email": "ryan.n.schmidt@ttuhsc.edu",
    "phone": "806-743-1477",
    "website": "",
    "about": "\nMy current research interests focus on health policy/management, translational/implementation management sciences, lean/continual process improvement, health operations/supply chain management, health compliance/risk management, competency-based education and workforce development. The focus of my research efforts identify management-related principles/practices and systems-thinking initiatives that impact and optimize operations through training and sustainment methods in leadership/management using competency-based skill development. A resource-based view is used to identify and evaluate gaps in management practices and/or inefficiencies/deficiencies in the use of known standards or technologies that modify the way innovative new standards are created and scaled.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Rebecca Schoen, PharmD, BCACP",
    "title": "Assistant Professor, Department of Pharmacy Practice – School of Pharmacy (Dallas Campus)",
    "email": "rebecca.schoen@ttuhsc.edu",
    "phone": "214-358-9045",
    "website": "",
    "about": "\nI'm a member of the Pharmacy Practice department in the School of Pharmacy. I like to speak with the other TTU researchers about their interests. My research interests are  below:",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Trent Seltzer, Ph.D.",
    "title": "Associate Professor, Department of Public Relations, College of Media & Communications; Assistant Dean, Graduate Studies",
    "email": "trent.seltzer@ttu.edu",
    "phone": "806-834-3803",
    "website": "https://www.depts.ttu.edu/comc/faculty/faculty/tseltzer.php",
    "about": "\nI have two main research foci. My first research area involves the study of organization-public relationship (OPR) management within political contexts (e.g., how political parties use communication to manage their relationship with party members). Over the years, I have extended my study of OPRs to include health, consumer, and other contexts. My second line of research involves investigating the role of strategic communication in promoting adolescent mental health with an emphasis on supporting programs that cultivate resiliency among adolescents. Two recent projects in this line of work involve studying the adolescent mental health information seeking and sharing behaviors of parents and examining how strategic communication efforts and media have influenced the public's perceptions of mental health issues and mental health policy. I would be interested in collaborating with faculty who are:",
    "institution": "Texas Tech University"
  },
  {
    "name": "Ruth Serra-Moreno, Ph.D.",
    "title": "Assistant Professor, Department of Biological Sciences",
    "email": "ruth.serra-moreno@ttu.edu",
    "phone": "806-834-0357",
    "website": "",
    "about": "\nHIV (human immunodeficiency virus) is the causative agent of AIDS, the worst human pandemic of the last 50 years. Despite the progress in the management of this disease, current treatments are unable to eliminate the virus form affected individuals. In search for a cure, Dr. Serra-Moreno research goal is to improve the activity of innate immune effectors. These molecules embody the first line of defense against virus pathogens, and thus, enhancing their restrictive activity is expected to block HIV. Current lab projects are focused on the role of the following cellular immune effectors:",
    "institution": "Texas Tech University"
  },
  {
    "name": "Chwan-Li (Leslie) Shen, Ph.D., C.C.R.P.",
    "title": "Associate Dean for Research, Professor of Pathology and Physiology; Founding Director, Center of Excellence for Integrative Health",
    "email": "",
    "phone": "806-743-2815",
    "website": "",
    "about": "Shen's research is focused on translational research related to musculoskeletal pathology, addressing bone, joint, and muscle health issues related to osteoporosis, osteoarthritis, and sarcopenia, in addition to other chronic diseases including obesity, diabetes, and frailty. Shen employed treatments/interventions such as nutrition (dietary nutrients, bioactive components, functional food, phytochemicals, and natural products) and exercise, and investigated mechanisms in animals and clinical trials. Shen's recent research includes natural product and pain management in both animals and humans. Dr. Shen just established a new center (Center of Excellence for Integrative Health) and she would like expand her research interest to the area of integrative health (nutrition) and patient-outcome related analysis and medical school curriculum elective.C",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Andrew C. Shin, Ph.D.",
    "title": "Research Assistant Professor, Department of Nutritional Sciences",
    "email": "andrew.shin@ttu.edu",
    "phone": "248-515-6908",
    "website": "",
    "about": "\nDr. Shin is interested in understanding how brain controls metabolism and nutrient partitioning as well as the long-term regulation of body weight and appetite and the underlying mechanisms of Roux-en-Y gastric bypass (RYGB) surgery. Dr. Shin's current NIH-funded research project aims to understand the role of insulin action in the brain in regulating branched-chain amino acid (BCAA) metabolism and how this central control can contribute to glucose homeostasis by using molecular, pharmacological, transgenic, surgical, and integrative physiological approaches.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Afzal A. Siddiqui, M.Phil., Ph.D.",
    "title": "Grover E. Murray Professor; Professor, Internal Medicine, Immunology, & Molecular Microbiology; Clinical Professor, Pathology; Vice President, Pharmacy Practice (Institutional Collaborations); Vice Chair (Research), Internal Medicine; Director, Center for Tropical Medicine & Infectious Disease",
    "email": "afzal.siddiqui@ttuhsc.edu",
    "phone": "806-743-2628",
    "website": "",
    "about": "\nDr. Siddiqui's research interests include: Vaccine discovery, development and testing for human parasite, Schistosoma mansoni. For over 25 years Dr. Siddiqui and his group has been working toward developing a vaccine against the human parasitic disease, schistosomiasis. This disease afflicts over 200 million people in 74 different countries; and an additional 800 million people are at risk of acquiring the infection. There is no vaccine available to protect against this infection. We have identified a vaccine candidate, Sm-p80, which plays a pivotal role in the surface membrane renewal of schistosomes, a phenomenon employed by hemo-helminths to evade host immunity. We have tested prophylactic and therapeutic efficacy of Sm-p80-based vaccine formulations in mouse and nonhuman primate models. Our published data indicate that Sm-p80 is now ready to be moved into Phase I/II human clinical trials in USA and Africa which are slated to start in 2019. Dr. Siddiqui holds a US and several international patents on Schistosomiasis Vaccine Compositions and Methods of Use. The development of a schistosome vaccine would be a major breakthrough and could potentially impact 1 billion people. An effective schistosome vaccine would contribute significantly toward reducing the disease spectrum and transmission of schistosomiasis.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Matthew G. Siebecker, Ph.D.",
    "title": "Assistant Professor of Applied Environmental Soil Chemistry, Department of Plant and Soil Science",
    "email": "matthew.siebecker@ttu.edu",
    "phone": "806-834-0266",
    "website": "Websites:",
    "about": "My research focuses on environmental soil chemical reactions such as adsorption, dissolution, surface precipitation, and redox of trace and heavy metal(loids) in contaminated and agricultural soils. My objective is to understand these fundamental soil chemical reactions at both the macroscopic and molecular scales, and then apply this understanding to assess and remediate field scale problems, such as contaminant or excess nutrient release into the environment. I have extensive experience working with synchrotron radiation (XAS/EXAFS/XANES) to identify and measure heavy metal contaminant and agricultural nutrient speciation in soils, minerals, and geochemical systems. I utilize traditional batch and stirred-flow techniques along with ICP-OES to determine elemental concentrations in solution effluent. I will acquire an advanced microcosm and anaerobic systems to control environmental conditions in the laboratory as they would be in the field, such as pH and redox potential. I am very interested how both coastal and inland contaminated soils are impacted by flooding due to climate change. I have worked with nickel, zinc, arsenic, chromium, phosphorus, and potassium along with iron and manganese oxides and clay phyllosilicate minerals. I am very happy to collaborate with people interested in using ICP-OES (brand new in my lab) and microwave digestion systems for soils, plants or tissues/fluids.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Sukhbir Singh, Ph.D.",
    "title": "Assistant Professor of Vegetable Production Systems, Department of Plant and Soil Science",
    "email": "s.singh@ttu.edu",
    "phone": "806-834-3108",
    "website": "",
    "about": "\nThe long-term goal of my research program is to determine the parameters (varieties, agronomic practices, etc.) leading to sustainable and profitable vegetable production. The target market for this production is high-quality vegetables for mid to high-income consumers (including up-scale restaurants and hotels). To achieve this goal, my research will focus on several aspects of organic and conventional vegetable production in open field, high tunnels and hydroponics. Specifically, I will work on sensor-based irrigation, nutrient management, biotic and abiotic stresses physiology, disease and pest control, cropping systems, and soil fertility management.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Quentin R. Smith, Ph.D.",
    "title": "University Distinguished Professor & Dean, School of Pharmacy; Senior Vice President for Research; Grover Murray Professor",
    "email": "Quentin.Smith@ttuhsc.edu",
    "phone": "806-414-9277",
    "website": "",
    "about": "\nDr. Smith's research interests center on drug delivery to the central nervous systems and the role of the blood-brain barrier. The barrier is located at the brain blood vessels the endothelial cells of which are tightly linked together to form a continuous cell membrane with very few pores or intercellular channels. Thus, compounds to gain access to most brain neurons and glia must either dissolve in and diffuse across the lipoid cell membrane of the brain barrier or be transported across by an array of selective transport carriers. Dr. Smith's research has focused on the properties and operation of these transporters, on drug design to optimize brain exposure, and on the function of the barrier in disease and aging. His expertise is in pharmacokinetics, barrier permeability, drug measurement (LC-MS/MS), drug localization (imaging), and in drug bioactivity (biomarkers).",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Terry C. Smith",
    "title": "Ph.D. Candidate, Technical Communication & Rhetoric; Department of Technical Communication & Rhetoric",
    "email": "terry.smith@ttu.edu",
    "phone": "806-742-2501",
    "website": "",
    "about": "\nMy research expertise is with usability, user experience (UX), user centered design (UCD), human centered design (HCD), and universal design (UD). I am currently researching virtual reality (VR) alternatives for medical training, surgical usage, and reduced distraction environments for studying and learning. I am also researching the Plain Language initiative to improve health literacy in the United States.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Phillip S. Sizer Jr., PT, PhD, OCS, FAAOMPT",
    "title": "Associate Dean for Research; Director, Doctor of Science in Physical Therapy Program",
    "email": "phil.sizer@ttuhsc.edu",
    "phone": "806-743-3902",
    "website": "",
    "about": "\nRESEARCHER and SCHOLAR-Phil's research interests include: sensorimotor control and functional biomechanics of spine / extremities; clinical pathoanatomy; and tissue and movement screening. He has authored over 110 peer-reviewed articles, 3 monographs, and 24 editorial commentaries in refereed journals. He has co-authored 12 international books or book chapters, and 12 Educational DVDs. He participated in over 170 research platform and poster presentations. He is co-author on several manuscripts out for review or under construction. He research-collaborates with 6 different national or international Universities. He was the recipient or co-recipient of over 15 local, state and national research awards, and has received both the 2015 SAHS Dean's Excellence in Research Award and 2018 TTU System Chancellor's Council Distinguished Research Award.\n ",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "George Z. Tan, Ph.D.",
    "title": "Assistant Professor, Department of Industrial Manufacturing & Systems Engineering",
    "email": "george.z.tan@ttu.edu",
    "phone": "806-834-3325",
    "website": "https://www.depts.ttu.edu/imse/aml/TAN_Laboratory.php",
    "about": "\nDr. George Z. Tan is an Assistant Professor of Industrial, Manufacturing and Systems Engineering at Texas Tech University. His current research interests are:",
    "institution": "Texas Tech University"
  },
  {
    "name": "Megan A. Thoen, Ph.D.",
    "title": "Institute for Forensic Science, Research Assistant Professor; Director of Forensic Mental Health Services, Department of Environmental Toxicology; Adjunct Faculty, Department of Psychological Sciences;",
    "email": "megan.thoen@ttu.edu",
    "phone": "(806) 834-1687",
    "website": "http://www.entx.ttu.edu/",
    "about": "\nMegan A. Thoen completed her Ph.D. in counseling psychology and was a post-doc and mental health manager at the Lubbock County Detention Center for almost a year before beginning at the Institute for Forensic Science as a post-doc focusing on forensic assessment. She is a licensed psychologist and completes court-ordered forensic mental health assessments for the Institute, including supervising several doctoral practicum students from the TTU Department of Psychological Sciences seeking training in forensic assessment. As the director of the EPiC-LEO (Experiences & Perspectives in the Criminal Justice System with a focus on Law Enforcement Organizations) research team, primary research activities include studying the mental health of law enforcement members (e.g., police officers, correctional officers) with a focus on wellness and suicide prevention programming/intervention, and the treatment of disenfranchised groups (e.g., minority races and cultures, severely mentally ill) within the criminal justice system with a focus on pre-trial proceedings (e.g., competency to stand trial proceedings, in-jail mental health treatment). Potential for collaboration includes those interested in law enforcement and the incarcerated mentally ill, particularly with focus on identification of symptoms including mental illness and mental wellness (i.e., resiliency) but also physiological or neurological markers of health in these groups, and program/intervention effectiveness for addressing these symptoms.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Elizabeth Trejos-Castillo, PhD.",
    "title": "C.R. Hutcheson Endowed Associate Professor, Human Development & Family Studies",
    "email": "elizabeth.trejos@ttu.edu",
    "phone": "806-834-6080",
    "website": "http://www.depts.ttu.edu/hs/hdfs/trejos-castillo.php",
    "about": "\nDr. Elizabeth Trejos-Castillo is the C.R. Hutcheson Endowed Associate Professor of Human Development & Family Studies at Texas Tech University. Dr. Trejos-Castillo is the founder and Director of the Graduate Minor and Graduate Certificate in Cross-Cultural Studies. She is an International Adjunct Professor in the Department of Applied Social Sciences at the State University of Ponta Grossa, Parana-Brazil as well as in the Departments of Psychology and Medicine, Biostatistics, and Epidemiology at CES University, Medellin-Colombia (South America). Her research focuses on the etiology of risk-taking behaviors, toxic-stress, trauma and deviance in vulnerable youth with a focus on ethnic minorities and underserved populations using a cross-cultural/cross-national mixed methods comparative approach. Elizabeth is the editor of the books: Handbook of Foster Youth (2018-. New York: Routledge, Taylor & Francis Group) and Youth: Practices, Perspectives and Challenges (2013; Nova Science Publishers, Hauppauge, NY) plus over 40 research papers and book chapters. She was a Fulbright Fellow in Brazil during 2018 funded by the U.S. Department of State conducting research with foster and juvenile justice youth. During the past 20+ years, she has worked closely with several local community, statewide partners, and international collaborators (e.g., Brazil, Colombia, Honduras, India) to support the well-being and positive developmental outcomes in vulnerable and at-risk youth.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Alex Trindade, Ph.D.",
    "title": "Professor, Department of Mathematics and Statistics",
    "email": "alex.trindade@ttu.edu",
    "phone": "806-834-6164",
    "website": "http://www.math.ttu.edu/~atrindad/",
    "about": "\nAlex's main methdological research lies in the development of new models for handling new situations, as well asthe refinement of existing techniques. These include: time series; multivariate volatility modeling; state-space models and longitudinal data; saddlepoint-based bootstrap methodology and applications; asymptotic theory and higher-order approximations. Alex has has extensive consulting experience and welcomes collaborative research opportunities. Examples: a reliability project with The Boeing Company funded by DARPA (2003); a contract with Encision, Inc., for reliability study on medical devices (2005); the phylogenetic analysis of bacterial genomes with TTU Biology (2012); models for predicting ER admission sponsored by Covenant Health (2016).",
    "institution": "Texas Tech University"
  },
  {
    "name": "Manisha Tripathi, Ph.D.",
    "title": "Assistant Professor, Department of Cell Biology & Biochemistry",
    "email": "Manisha.Tripathi@ttuhsc.edu",
    "phone": "806-743-4140",
    "website": "",
    "about": "\nThere is no effective therapeutic strategy against metastatic castrate resistant prostate cancer. Prostate tumor cells constantly interact with the surrounding microenvironment during all steps of the metastatic cascade. Our research is focused on studying the role of the tumor microenvironment in prostate cancer progression and metastasis. Specifically, we study how the different cells of tumor microenvironment including cancer associated fibroblasts (CAFs), and tumor associated macrophages (TAMs) interact with cancer cells to fuel the progression of the disease. Broadly, we focus on understanding two critical facets of the prostate cancer biology with the goal of developing novel therapeutic strategies against the tumor-microenvironment interactions:\nOur approach to studying these interactions is through the use of in vitro and in vivo model systems. For investigating the role of stromal factors (prostate CAFs and bone marrow derived stromal cells) in maintaining and supporting the cancer stem cell niche, we utilize transgenic mouse models, xenograft mouse models, 3-D culture systems, and Patient-Derived Xenograft (PDX) models. In addition, our research focuses on how the host microenvironment including the immune cells have the potential to mediate the efficacy of anti-cancer drugs. This is supported by our recent studies that demonstrate prostate cancer bone metastatic microenvironment – primarily through CAFs and TAMs - as potential mediators of drug efficacy in advanced prostate cancer. Our findings underscore the critical need for dissecting the crosstalk between prostate cancer and the tumor immune microenvironment in understanding tumor progression and drug response in an effort towards developing novel therapeutic approaches to target this lethal disease.",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Antover P. Tuliao, Ph.D.",
    "title": "Assistant Professor, Department of Community, Family, and Addiction Sciences",
    "email": "antover.tuliao@ttu.edu",
    "phone": "806-834-6632",
    "website": "http://www.depts.ttu.edu/hs/cfas/tuliao.php",
    "about": "\nDr. Tuliao's research interest broadly focuses on substance use disorders, in particular its underlying mechanism, treatment, and reduction/prevention of substance use-related harm. Working under the assumption that SUD is an executive control dysfunction, his research focuses on biases in decisional processes that drive the inability to control both substance use and subsequent problematic behavior. Dr. Tuliao's current research projects include examining decisional processes underlying alcohol-involved sexual assault among college students. In addition to decision processes, Dr. Tuliao also studies the impact of culture on SUD, its symptom expression, and treatment. He believes that understanding cultural factors could inform SUD treatment and improve help-seeking behaviors and treatment utilization. Current research on this area includes a cross-cultural study on drinking behaviors and cognitions between the U.S. and the Philippines. Potential TTU-HSC collaboration: research on alcohol/substance use disorders and harm reduction.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Minerva D. Tuliao, Ph.D.",
    "title": "Research Affiliate, Department of Community, Family, and Addiction Sciences",
    "email": "minerva.tuliao@ttu.edu",
    "phone": "806-834-1854",
    "website": "",
    "about": "\nMy areas of research expertise and interests include higher education leadership and administration, graduate employability and career/workforce development, adult and continuing education, organization research and development, and cultural and mixed methods research. Potential TTU-HSC collaboration:\n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Chunmei Wang, Ph.D.",
    "title": "Assistant Professor, Department of Mathematics & Statistics",
    "email": "chunmei.wang@ttu.edu",
    "phone": "806-834-7655",
    "website": "",
    "about": "\nDr. Wang's research interests fall under the broad heading of numerical methods and scientific computing for problems in science and engineering governed by partial differential equations. Her research is interdisciplinary and addresses modeling and computation of applied problems in science and engineering. She has devised new finite element methods and established the corresponding convergence analysis for (1) linear hyperbolic equations, (2) elliptic Cauchy problems, (3) second order elliptic equations in nondivergence form, (4) Maxwell's equation, (5) linear elasticity and elastic interface problems, (6) div-curl systems, and (7) biharmonic equations.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Shu Wang, Ph.D.",
    "title": "Associate Professor, Department of Nutritional Sciences",
    "email": "shu.wang@ttu.edu",
    "phone": "806-317-0746",
    "website": "",
    "about": "\nResearch Interests:\nProposed Collaboration:\nKeywords in my current research are the following:\nNutrition, Lipid Metabolism, Inflammation, Dietary Fat, Phytochemicals, Nanotechnology, Obesity, Diabetes, and Atherosclerosis.\nKeywords in my current research are the following:\nNutrition, Lipid Metabolism, Inflammation, Dietary Fat, Phytochemicals, Nanotechnology, Obesity, Diabetes, and Atherosclerosis.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Zhe Wang, Ph.D.",
    "title": "Assistant Professor, Department of Human Development and Family Studies",
    "email": "zhe.wang@ttu.edu",
    "phone": "806-834-5065",
    "website": "http://www.depts.ttu.edu/hs/hdfs/wang.php",
    "about": "I study the development of cognitive abilities and educational attainments in children and young adolescents. My research incorporates genetic, physiological, eye-tracking, and behavioral approaches, and examines how factors at these various levels interact with environmental context (e.g., socioeconomic backgrounds, chaotic household environments, and harsh parenting) to produce diverse developmental trajectories in students' achievement outcomes. Another component of my research is to study how child characteristics, in turn, shape their own environment (e.g., how they are parented). I am open to various collaboration opportunities, and look forward to establishing collaborative relations with faculties all around campus.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Chuck West, Ph.D.",
    "title": "Professor and Thorton Distinguished Chair, Department of Plant & Soil Science; Director, CASNR Water Center, Texas Alliance for Water Conservation",
    "email": "chuck.west@ttu.edu",
    "phone": "806-834-4160 (Office)",
    "website": "http://www.tawc.us",
    "about": "I am director of the CASNR Water Center, by which I communicate to faculty in the College of Agricultural Sciences and Natural Resources opportunities for funding, collaborative research, conferences, enrichment opportunities for students, and newly published materials of common interest in topics related to water that are relevant to the departments in our College. I wish to hear about other water-related interests there are across the TTU campus so that I can help match up potential collaborations. I also administer the Texas Alliance for Water Conservation, which is an outreach office for expediting the transfer of technology to farmers in the Texas High Plains on ways to economically conserve groundwater when irrigating crops. Our group has a deep database and knowledge base of local farming practices as affected by irrigation management. Potentials exist for collaborations with faculty in the CASNR Water Center and TAWC which I can help catalyze.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Nadeeja Wijayatunga, Ph.D.",
    "title": "Postdoctoral Research Associate, Department of Kinesiology and Sport Management",
    "email": "nadeeja.wijayatunga@ttu.edu",
    "phone": "806-834-6191",
    "website": "",
    "about": "\nI received Ph.D. in nutritional sciences from Texas Tech University and my doctoral dissertation focused on changes in inflammation and metabolism following bariatric surgery, and adipose tissue depot-specific differences gene expression and microRNA profiles in obesity. My postdoctoral research experience involves a range of clinical/ behavioral research studies that test behavioral and psychosocial causes of obesity as well as dietary and physical activity interventions for treatment of obesity. I am specifically interested in studying normal weight obesity (NWO) where individuals have a normal weight but high body fat percentage. This is an understudied population who are at a higher risk for cardio-metabolic diseases.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Andy Wilkinson",
    "title": "Artist in Residence, Southwest Collection/Special Collections Library; Committee Chair, Creative Process Commons",
    "email": "andy.wilkinson@ttu.edu",
    "phone": "806-834-8391",
    "website": "",
    "about": "\nI am the committee chair for The Creative Process Commons, an initiative of the Office of the Provost that is a non-hierarchical network designed to connect creative people across both Texas Tech University and its wider community. With the long-term aim of providing leadership in the study of the creative process and in the empowerment of creative ways of working, the Commons is a campus-wide effort to engage faculty, staff, and students from all disciplines in the fostering of transdisciplinary projects and thinking that will invigorate creative processes and stimulate innovation across the institution. To those ends, it is designed to complement and leverage existing undertakings on campus by providing opportunities for creative activities and processes to be initiated, nurtured, and ultimately yield new enlightenment and knowledge. Finally, but of equal importance, the Commons is a vehicle for documenting and archiving creative process activities, which entails identifying and securing support for various projects and works associated with the study of creative processes as well as the acquisition and maintenance of resources (e.g., collections and archives) that are used by members of the Commons.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Alexander W. Wiseman, Ph.D.",
    "title": "Professor, Educational Leadership (Policy), Department of Educational Psychology & Leadership",
    "email": "Alexander.Wiseman@ttu.edu",
    "phone": "806-834-7193",
    "website": "",
    "about": "\nI am a specialist in developing sustainable education policy based on large-scale data to create equitable educational access and achievement, specifically related to gender and socioeconomic status. My research focuses on the effect education has on achievement, health, and socio-economic mobility for the most marginalized populations. Recent work focuses on refugee and asylum-seeking youth and how educators are (and aren't) prepared to work with them. This includes how teachers do/don't deal with trauma issues that students bring to the school and classroom. Trauma-informed teaching is a significant need in the work I do related to refugee and asylum-seeking youth in schools. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Changxue Xu, Ph.D.",
    "title": "Assistant Professor, Department of Industrial, Manufacturing, and Systems Engineering",
    "email": "changxue.xu@ttu.edu",
    "phone": "806-834-6014",
    "website": "www.depts.ttu.edu/imse/aml/bioprinting_biofabrication.php",
    "about": "\nExpertise and Extensive Experience:\nHow to utilize various 3D bioprinting technologies and different advanced manufacturing technologies to process biological materials and cells for fabrication of complex 2D/3D structures.\nExpertise and Extensive Experience:\nHow to utilize various 3D bioprinting technologies and different advanced manufacturing technologies to process biological materials and cells for fabrication of complex 2D/3D structures.\nMy lab is currently equipped with inkjet 3D bioprinting system, microextrusion 3D bioprinting, and stereolithography 3D bioprinting system. \n ",
    "institution": "Texas Tech University"
  },
  {
    "name": "Sangmi Yoo, M.F.A.",
    "title": "Associate Director, Talkington College of Visual and Performing Arts; Professor of Art, Talkington College of Visual and Performing Arts",
    "email": "sangmi.yoo@ttu.edu",
    "phone": "(806) 834-4937",
    "website": "http://www.sangmiyoo.com",
    "about": "\nI am visual artist with expertise in drawing, print and digital media. While I have a long exhibition history of presenting fine art work, I have a background in computer graphics. My colleague David Lindsay and I in the School of Art have been working on developing an undergraduate curriculum called \"Scientific Visualization\" that connects art, medicine, sciences and engineering. As an initial approach, we are building a partnership with Medical Education department at TTU Health Science Center. Our life drawing students took field trips to the Gross Anatomy Lab at the Graduate School of Biomedical Sciences while art faculty offered workshops to medical students. This partnership is bringing me a better understanding of the TTUHSC's academic programs, the educational structure and the current trend in research. Once the program takes place, I foresee our innovative use of digital technology and well-executed drawing/illustration/animation skills will provide a catalyst to a variety of research projects by researchers, faculty and students at TTU and TTUHSC.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Jonathan Young, Ph.D.",
    "title": "Student, School of Medicine – Class of 2021",
    "email": "jonathan.h.young@ttuhsc.edu",
    "phone": "",
    "website": "",
    "about": "\nJonathan Young, PhD is a second-year medical student at the Texas Tech University Health Sciences Center working on machine learning to predict balance instability in patients for the prevention of fall injuries. He is a member of an interdisciplinary team led by Donald Lie, PhD who is the Keh-Shew Lu Regents Chair and Professor in Electrical and Computer Engineering at Texas Tech University. Professor Lie heads the Radio-Frequency System-on-a-Chip (RF-SoC) Group working on medical electronics, biosensors and biosignal processing. The clinical research efforts are directed by Tam Nguyen, MD from the Department of Otolaryngology and Steven Zupancic, PhD, Au.D. from the Department of Speech and Hearing Sciences at the Texas Tech University Health Sciences Center. Dr. Nguyen's clinical interests are in cochlear implants and otological surgeries, and his research interests include smart wearable and wireless biosensors. \n ",
    "institution": "Texas Tech University Health Sciences Center"
  },
  {
    "name": "Fangyuan Zhang, Ph.D.",
    "title": "Assistant Professor of Statistics, Department of Mathematics and Statistics",
    "email": "fangyuan.zhang@ttu.edu",
    "phone": "806-834-2587",
    "website": "http://www.myweb.ttu.edu/fangzhan/",
    "about": "\nMy primary research area is in biostatistics and statistical genetics, including developing parametric and nonparametric statistical methods to detect genetic and epigenetic effects under different study designs, and testing for association in a heterogeneous sample and its application on tumor clustering based on gene signatures. I have extensive expertise and training for working with data, including data cleaning, coding, modeling, analysis, and interpretation. I am interested in collaborating in genetic/biological/medical/health data analysis.",
    "institution": "Texas Tech University"
  },
  {
    "name": "Julie Zook, M.Arch., Ph.D.",
    "title": "Assistant Professor, College of Architecture",
    "email": "julie.zook@ttu.edu",
    "phone": "806-834-0699",
    "website": "",
    "about": "\nMy research builds correlative models between the design of the physical environment and process and outcome variables in health and healthcare. Using fine-grained, quantitative descriptions of the physical environment, my research on health spans from building interiors to the urban and territorial scale. A recent multiple case study with an industry partner developed correlations between interior spatial attributes and staff-perceived design support for teamwork and time at patient bedside. At the urban scale, I have assessed how land uses and the design of the street network impact walking prevalence as part of a CDC-funded project. In addition to building on these existing lines, I am interested in future work that studies and develops new models for built infrastructure aimed at promoting and restoring health in rural settings.\n ",
    "institution": "Texas Tech University"
  }
]
